SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pehb_template/common/hc32f460pehb.h
typedef struct
{
    __IO uint32_t STARTFCLR                 : 1;
    __IO uint32_t SLADDR0FCLR               : 1;
    __IO uint32_t SLADDR1FCLR               : 1;
    __IO uint32_t TENDFCLR                  : 1;
    __IO uint32_t STOPFCLR                  : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLFCLR                 : 1;
    __IO uint32_t TEMPTYFCLR                : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOFCLR                  : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t NACKFCLR                  : 1;
    uint32_t RESERVED13                     : 1;
    __IO uint32_t TMOUTFCLR                 : 1;
    uint32_t RESERVED15                     : 5;
    __IO uint32_t GENCALLFCLR               : 1;
    __IO uint32_t SMBDEFAULTFCLR            : 1;
    __IO uint32_t SMBHOSTFCLR               : 1;
    __IO uint32_t SMBALRTFCLR               : 1;
    uint32_t RESERVED24                     : 8;
} stc_i2c_clr_field_t;

typedef struct
{
    __IO uint8_t DT                         : 8;
} stc_i2c_dtr_field_t;

typedef struct
{
    __IO uint8_t DR                         : 8;
} stc_i2c_drr_field_t;

typedef struct
{
    __IO uint32_t SLOWW                     : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t SHIGHW                    : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t FREQ                      : 3;
    uint32_t RESERVED19                     :13;
} stc_i2c_ccr_field_t;

typedef struct
{
    __IO uint32_t DNF                       : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t DNFEN                     : 1;
    __IO uint32_t ANFEN                     : 1;
    uint32_t RESERVED6                      :26;
} stc_i2c_fltr_field_t;

typedef struct
{
    __IO uint32_t TXE                       : 1;
    __IO uint32_t TXIE                      : 1;
    __IO uint32_t RXE                       : 1;
    __IO uint32_t RXIE                      : 1;
    __IO uint32_t EIE                       : 1;
    __IO uint32_t WMS                       : 1;
    __IO uint32_t ODD                       : 1;
    __IO uint32_t MCKOE                     : 1;
    __IO uint32_t TXBIRQWL                  : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t RXBIRQWL                  : 3;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t FIFOR                     : 1;
    __IO uint32_t CODECRC                   : 1;
    __IO uint32_t I2SPLLSEL                 : 1;
    __IO uint32_t SDOE                      : 1;
    __IO uint32_t LRCKOE                    : 1;
    __IO uint32_t CKOE                      : 1;
    __IO uint32_t DUPLEX                    : 1;
    __IO uint32_t CLKSEL                    : 1;
    uint32_t RESERVED24                     : 8;
} stc_i2s_ctrl_field_t;

typedef struct
{
    __IO uint32_t TXBA                      : 1;
    __IO uint32_t RXBA                      : 1;
    __IO uint32_t TXBE                      : 1;
    __IO uint32_t TXBF                      : 1;
    __IO uint32_t RXBE                      : 1;
    __IO uint32_t RXBF                      : 1;
    uint32_t RESERVED6                      :26;
} stc_i2s_sr_field_t;

typedef struct
{
    __IO uint32_t TXERR                     : 1;
    __IO uint32_t RXERR                     : 1;
    uint32_t RESERVED2                      :30;
} stc_i2s_er_field_t;

typedef struct
{
    __IO uint32_t I2SSTD                    : 2;
    __IO uint32_t DATLEN                    : 2;
    __IO uint32_t CHLEN                     : 1;
    __IO uint32_t PCMSYNC                   : 1;
    uint32_t RESERVED6                      :26;
} stc_i2s_cfgr_field_t;

typedef struct
{
    __IO uint32_t I2SDIV                    : 8;
    uint32_t RESERVED8                      :24;
} stc_i2s_pr_field_t;

typedef struct
{
    __IO uint32_t SWDTAUTS                  : 1;
    __IO uint32_t SWDTITS                   : 1;
    __IO uint32_t SWDTPERI                  : 2;
    __IO uint32_t SWDTCKS                   : 4;
    __IO uint32_t SWDTWDPT                  : 4;
    __IO uint32_t SWDTSLPOFF                : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t WDTAUTS                   : 1;
    __IO uint32_t WDTITS                    : 1;
    __IO uint32_t WDTPERI                   : 2;
    __IO uint32_t WDTCKS                    : 4;
    __IO uint32_t WDTWDPT                   : 4;
    __IO uint32_t WDTSLPOFF                 : 1;
    uint32_t RESERVED29                     : 3;
} stc_icg_icg0_field_t;

typedef struct
{
    __IO uint32_t HRCFREQSEL                : 1;
    uint32_t RESERVED1                      : 7;
    __IO uint32_t HRCSTOP                   : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t BOR_LEV                   : 2;
    __IO uint32_t BORDIS                    : 1;
    uint32_t RESERVED19                     : 7;
    __IO uint32_t SMPCLK                    : 2;
    __IO uint32_t NMITRG                    : 1;
    __IO uint32_t NMIENR                    : 1;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t NMIICGENA                 : 1;
} stc_icg_icg1_field_t;

typedef struct
{
    __IO uint32_t NMITRG                    : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t NSMPCLK                   : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t NFEN                      : 1;
    uint32_t RESERVED8                      :24;
} stc_intc_nmicr_field_t;

typedef struct
{
    __IO uint32_t NMIENR                    : 1;
    __IO uint32_t SWDTENR                   : 1;
    __IO uint32_t PVD1ENR                   : 1;
    __IO uint32_t PVD2ENR                   : 1;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t XTALSTPENR                : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t REPENR                    : 1;
    __IO uint32_t RECCENR                   : 1;
    __IO uint32_t BUSMENR                   : 1;
    __IO uint32_t WDTENR                    : 1;
    uint32_t RESERVED12                     :20;
} stc_intc_nmienr_field_t;

typedef struct
{
    __IO uint32_t NMIFR                     : 1;
    __IO uint32_t SWDTFR                    : 1;
    __IO uint32_t PVD1FR                    : 1;
    __IO uint32_t PVD2FR                    : 1;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t XTALSTPFR                 : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t REPFR                     : 1;
    __IO uint32_t RECCFR                    : 1;
    __IO uint32_t BUSMFR                    : 1;
    __IO uint32_t WDTFR                     : 1;
    uint32_t RESERVED12                     :20;
} stc_intc_nmifr_field_t;

typedef struct
{
    __IO uint32_t NMICFR                    : 1;
    __IO uint32_t SWDTCFR                   : 1;
    __IO uint32_t PVD1CFR                   : 1;
    __IO uint32_t PVD2CFR                   : 1;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t XTALSTPCFR                : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t REPCFR                    : 1;
    __IO uint32_t RECCCFR                   : 1;
    __IO uint32_t BUSMCFR                   : 1;
    __IO uint32_t WDTCFR                    : 1;
    uint32_t RESERVED12                     :20;
} stc_intc_nmicfr_field_t;

typedef struct
{
    __IO uint32_t EIRQTRG                   : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t EISMPCLK                  : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t EFEN                      : 1;
    uint32_t RESERVED8                      :24;
} stc_intc_eirqcr_field_t;

typedef struct
{
    __IO uint32_t EIRQWUEN                  :16;
    __IO uint32_t SWDTWUEN                  : 1;
    __IO uint32_t PVD1WUEN                  : 1;
    __IO uint32_t PVD2WUEN                  : 1;
    __IO uint32_t CMPI0WUEN                 : 1;
    __IO uint32_t WKTMWUEN                  : 1;
    __IO uint32_t RTCALMWUEN                : 1;
    __IO uint32_t RTCPRDWUEN                : 1;
    __IO uint32_t TMR0WUEN                  : 1;
    uint32_t RESERVED24                     : 1;
    __IO uint32_t RXWUEN                    : 1;
    uint32_t RESERVED26                     : 6;
} stc_intc_wupen_field_t;

typedef struct
{
    __IO uint32_t EIFR0                     : 1;
    __IO uint32_t EIFR1                     : 1;
    __IO uint32_t EIFR2                     : 1;
    __IO uint32_t EIFR3                     : 1;
    __IO uint32_t EIFR4                     : 1;
    __IO uint32_t EIFR5                     : 1;
    __IO uint32_t EIFR6                     : 1;
    __IO uint32_t EIFR7                     : 1;
    __IO uint32_t EIFR8                     : 1;
    __IO uint32_t EIFR9                     : 1;
    __IO uint32_t EIFR10                    : 1;
    __IO uint32_t EIFR11                    : 1;
    __IO uint32_t EIFR12                    : 1;
    __IO uint32_t EIFR13                    : 1;
    __IO uint32_t EIFR14                    : 1;
    __IO uint32_t EIFR15                    : 1;
    uint32_t RESERVED16                     :16;
} stc_intc_eifr_field_t;

typedef struct
{
    __IO uint32_t EICFR0                    : 1;
    __IO uint32_t EICFR1                    : 1;
    __IO uint32_t EICFR2                    : 1;
    __IO uint32_t EICFR3                    : 1;
    __IO uint32_t EICFR4                    : 1;
    __IO uint32_t EICFR5                    : 1;
    __IO uint32_t EICFR6                    : 1;
    __IO uint32_t EICFR7                    : 1;
    __IO uint32_t EICFR8                    : 1;
    __IO uint32_t EICFR9                    : 1;
    __IO uint32_t EICFR10                   : 1;
    __IO uint32_t EICFR11                   : 1;
    __IO uint32_t EICFR12                   : 1;
    __IO uint32_t EICFR13                   : 1;
    __IO uint32_t EICFR14                   : 1;
    __IO uint32_t EICFR15                   : 1;
    uint32_t RESERVED16                     :16;
} stc_intc_eicfr_field_t;

typedef struct
{
    __IO uint32_t INTSEL                    : 9;
    uint32_t RESERVED9                      :23;
} stc_intc_sel_field_t;

typedef struct
{
    __IO uint32_t VSEL0                     : 1;
    __IO uint32_t VSEL1                     : 1;
    __IO uint32_t VSEL2                     : 1;
    __IO uint32_t VSEL3                     : 1;
    __IO uint32_t VSEL4                     : 1;
    __IO uint32_t VSEL5                     : 1;
    __IO uint32_t VSEL6                     : 1;
    __IO uint32_t VSEL7                     : 1;
    __IO uint32_t VSEL8                     : 1;
    __IO uint32_t VSEL9                     : 1;
    __IO uint32_t VSEL10                    : 1;
    __IO uint32_t VSEL11                    : 1;
    __IO uint32_t VSEL12                    : 1;
    __IO uint32_t VSEL13                    : 1;
    __IO uint32_t VSEL14                    : 1;
    __IO uint32_t VSEL15                    : 1;
    __IO uint32_t VSEL16                    : 1;
    __IO uint32_t VSEL17                    : 1;
    __IO uint32_t VSEL18                    : 1;
    __IO uint32_t VSEL19                    : 1;
    __IO uint32_t VSEL20                    : 1;
    __IO uint32_t VSEL21                    : 1;
    __IO uint32_t VSEL22                    : 1;
    __IO uint32_t VSEL23                    : 1;
    __IO uint32_t VSEL24                    : 1;
    __IO uint32_t VSEL25                    : 1;
    __IO uint32_t VSEL26                    : 1;
    __IO uint32_t VSEL27                    : 1;
    __IO uint32_t VSEL28                    : 1;
    __IO uint32_t VSEL29                    : 1;
    __IO uint32_t VSEL30                    : 1;
    __IO uint32_t VSEL31                    : 1;
} stc_intc_vssel_field_t;

typedef struct
{
    __IO uint32_t SWIE0                     : 1;
    __IO uint32_t SWIE1                     : 1;
    __IO uint32_t SWIE2                     : 1;
    __IO uint32_t SWIE3                     : 1;
    __IO uint32_t SWIE4                     : 1;
    __IO uint32_t SWIE5                     : 1;
    __IO uint32_t SWIE6                     : 1;
    __IO uint32_t SWIE7                     : 1;
    __IO uint32_t SWIE8                     : 1;
    __IO uint32_t SWIE9                     : 1;
    __IO uint32_t SWIE10                    : 1;
    __IO uint32_t SWIE11                    : 1;
    __IO uint32_t SWIE12                    : 1;
    __IO uint32_t SWIE13                    : 1;
    __IO uint32_t SWIE14                    : 1;
    __IO uint32_t SWIE15                    : 1;
    __IO uint32_t SWIE16                    : 1;
    __IO uint32_t SWIE17                    : 1;
    __IO uint32_t SWIE18                    : 1;
    __IO uint32_t SWIE19                    : 1;
    __IO uint32_t SWIE20                    : 1;
    __IO uint32_t SWIE21                    : 1;
    __IO uint32_t SWIE22                    : 1;
    __IO uint32_t SWIE23                    : 1;
    __IO uint32_t SWIE24                    : 1;
    __IO uint32_t SWIE25                    : 1;
    __IO uint32_t SWIE26                    : 1;
    __IO uint32_t SWIE27                    : 1;
    __IO uint32_t SWIE28                    : 1;
    __IO uint32_t SWIE29                    : 1;
    __IO uint32_t SWIE30                    : 1;
    __IO uint32_t SWIE31                    : 1;
} stc_intc_swier_field_t;

typedef struct
{
    __IO uint32_t EVTE0                     : 1;
    __IO uint32_t EVTE1                     : 1;
    __IO uint32_t EVTE2                     : 1;
    __IO uint32_t EVTE3                     : 1;
    __IO uint32_t EVTE4                     : 1;
    __IO uint32_t EVTE5                     : 1;
    __IO uint32_t EVTE6                     : 1;
    __IO uint32_t EVTE7                     : 1;
    __IO uint32_t EVTE8                     : 1;
    __IO uint32_t EVTE9                     : 1;
    __IO uint32_t EVTE10                    : 1;
    __IO uint32_t EVTE11                    : 1;
    __IO uint32_t EVTE12                    : 1;
    __IO uint32_t EVTE13                    : 1;
    __IO uint32_t EVTE14                    : 1;
    __IO uint32_t EVTE15                    : 1;
    __IO uint32_t EVTE16                    : 1;
    __IO uint32_t EVTE17                    : 1;
    __IO uint32_t EVTE18                    : 1;
    __IO uint32_t EVTE19                    : 1;
    __IO uint32_t EVTE20                    : 1;
    __IO uint32_t EVTE21                    : 1;
    __IO uint32_t EVTE22                    : 1;
    __IO uint32_t EVTE23                    : 1;
    __IO uint32_t EVTE24                    : 1;
    __IO uint32_t EVTE25                    : 1;
    __IO uint32_t EVTE26                    : 1;
    __IO uint32_t EVTE27                    : 1;
    __IO uint32_t EVTE28                    : 1;
    __IO uint32_t EVTE29                    : 1;
    __IO uint32_t EVTE30                    : 1;
    __IO uint32_t EVTE31                    : 1;
} stc_intc_evter_field_t;

typedef struct
{
    __IO uint32_t IER0                      : 1;
    __IO uint32_t IER1                      : 1;
    __IO uint32_t IER2                      : 1;
    __IO uint32_t IER3                      : 1;
    __IO uint32_t IER4                      : 1;
    __IO uint32_t IER5                      : 1;
    __IO uint32_t IER6                      : 1;
    __IO uint32_t IER7                      : 1;
    __IO uint32_t IER8                      : 1;
    __IO uint32_t IER9                      : 1;
    __IO uint32_t IER10                     : 1;
    __IO uint32_t IER11                     : 1;
    __IO uint32_t IER12                     : 1;
    __IO uint32_t IER13                     : 1;
    __IO uint32_t IER14                     : 1;
    __IO uint32_t IER15                     : 1;
    __IO uint32_t IER16                     : 1;
    __IO uint32_t IER17                     : 1;
    __IO uint32_t IER18                     : 1;
    __IO uint32_t IER19                     : 1;
    __IO uint32_t IER20                     : 1;
    __IO uint32_t IER21                     : 1;
    __IO uint32_t IER22                     : 1;
    __IO uint32_t IER23                     : 1;
    __IO uint32_t IER24                     : 1;
    __IO uint32_t IER25                     : 1;
    __IO uint32_t IER26                     : 1;
    __IO uint32_t IER27                     : 1;
    __IO uint32_t IER28                     : 1;
    __IO uint32_t IER29                     : 1;
    __IO uint32_t IER30                     : 1;
    __IO uint32_t IER31                     : 1;
} stc_intc_ier_field_t;

typedef struct
{
    __IO uint32_t KEYINSEL                  :16;
    __IO uint32_t KEYOUTSEL                 : 3;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t CKSEL                     : 2;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t T_LLEVEL                  : 5;
    __IO uint32_t T_HIZ                     : 3;
} stc_keyscan_scr_field_t;

typedef struct
{
    __IO uint32_t SEN                       : 1;
    uint32_t RESERVED1                      :31;
} stc_keyscan_ser_field_t;

typedef struct
{
    __IO uint32_t INDEX                     : 3;
    uint32_t RESERVED3                      :29;
} stc_keyscan_ssr_field_t;

typedef struct
{
    __IO uint32_t MPURG0SIZE                : 5;
    __IO uint32_t MPURG0ADDR                :27;
} stc_mpu_rgd0_field_t;

typedef struct
{
    __IO uint32_t MPURG1SIZE                : 5;
    __IO uint32_t MPURG1ADDR                :27;
} stc_mpu_rgd1_field_t;

typedef struct
{
    __IO uint32_t MPURG2SIZE                : 5;
    __IO uint32_t MPURG2ADDR                :27;
} stc_mpu_rgd2_field_t;

typedef struct
{
    __IO uint32_t MPURG3SIZE                : 5;
    __IO uint32_t MPURG3ADDR                :27;
} stc_mpu_rgd3_field_t;

typedef struct
{
    __IO uint32_t MPURG4SIZE                : 5;
    __IO uint32_t MPURG4ADDR                :27;
} stc_mpu_rgd4_field_t;

typedef struct
{
    __IO uint32_t MPURG5SIZE                : 5;
    __IO uint32_t MPURG5ADDR                :27;
} stc_mpu_rgd5_field_t;

typedef struct
{
    __IO uint32_t MPURG6SIZE                : 5;
    __IO uint32_t MPURG6ADDR                :27;
} stc_mpu_rgd6_field_t;

typedef struct
{
    __IO uint32_t MPURG7SIZE                : 5;
    __IO uint32_t MPURG7ADDR                :27;
} stc_mpu_rgd7_field_t;

typedef struct
{
    __IO uint32_t MPURG8SIZE                : 5;
    __IO uint32_t MPURG8ADDR                :27;
} stc_mpu_rgd8_field_t;

typedef struct
{
    __IO uint32_t MPURG9SIZE                : 5;
    __IO uint32_t MPURG9ADDR                :27;
} stc_mpu_rgd9_field_t;

typedef struct
{
    __IO uint32_t MPURG10SIZE               : 5;
    __IO uint32_t MPURG10ADDR               :27;
} stc_mpu_rgd10_field_t;

typedef struct
{
    __IO uint32_t MPURG11SIZE               : 5;
    __IO uint32_t MPURG11ADDR               :27;
} stc_mpu_rgd11_field_t;

typedef struct
{
    __IO uint32_t MPURG12SIZE               : 5;
    __IO uint32_t MPURG12ADDR               :27;
} stc_mpu_rgd12_field_t;

typedef struct
{
    __IO uint32_t MPURG13SIZE               : 5;
    __IO uint32_t MPURG13ADDR               :27;
} stc_mpu_rgd13_field_t;

typedef struct
{
    __IO uint32_t MPURG14SIZE               : 5;
    __IO uint32_t MPURG14ADDR               :27;
} stc_mpu_rgd14_field_t;

typedef struct
{
    __IO uint32_t MPURG15SIZE               : 5;
    __IO uint32_t MPURG15ADDR               :27;
} stc_mpu_rgd15_field_t;

typedef struct
{
    __IO uint32_t S2RG0RP                   : 1;
    __IO uint32_t S2RG0WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG0E                    : 1;
    __IO uint32_t S1RG0RP                   : 1;
    __IO uint32_t S1RG0WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG0E                    : 1;
    __IO uint32_t FRG0RP                    : 1;
    __IO uint32_t FRG0WP                    : 1;
    uint32_t RESERVED18                     : 5;
    __IO uint32_t FRG0E                     : 1;
    uint32_t RESERVED24                     : 8;
} stc_mpu_rgcr0_field_t;

typedef struct
{
    __IO uint32_t S2RG1RP                   : 1;
    __IO uint32_t S2RG1WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG1E                    : 1;
    __IO uint32_t S1RG1RP                   : 1;
    __IO uint32_t S1RG1WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG1E                    : 1;
    __IO uint32_t FRG1RP                    : 1;
    __IO uint32_t FRG1WP                    : 1;
    uint32_t RESERVED18                     : 5;
    __IO uint32_t FRG1E                     : 1;
    uint32_t RESERVED24                     : 8;
} stc_mpu_rgcr1_field_t;

typedef struct
{
    __IO uint32_t S2RG2RP                   : 1;
    __IO uint32_t S2RG2WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG2E                    : 1;
    __IO uint32_t S1RG2RP                   : 1;
    __IO uint32_t S1RG2WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG2E                    : 1;
    __IO uint32_t FRG2RP                    : 1;
    __IO uint32_t FRG2WP                    : 1;
    uint32_t RESERVED18                     : 5;
    __IO uint32_t FRG2E                     : 1;
    uint32_t RESERVED24                     : 8;
} stc_mpu_rgcr2_field_t;

typedef struct
{
    __IO uint32_t S2RG3RP                   : 1;
    __IO uint32_t S2RG3WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG3E                    : 1;
    __IO uint32_t S1RG3RP                   : 1;
    __IO uint32_t S1RG3WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG3E                    : 1;
    __IO uint32_t FRG3RP                    : 1;
    __IO uint32_t FRG3WP                    : 1;
    uint32_t RESERVED18                     : 5;
    __IO uint32_t FRG3E                     : 1;
    uint32_t RESERVED24                     : 8;
} stc_mpu_rgcr3_field_t;

typedef struct
{
    __IO uint32_t S2RG4RP                   : 1;
    __IO uint32_t S2RG4WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG4E                    : 1;
    __IO uint32_t S1RG4RP                   : 1;
    __IO uint32_t S1RG4WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG4E                    : 1;
    __IO uint32_t FRG4RP                    : 1;
    __IO uint32_t FRG4WP                    : 1;
    uint32_t RESERVED18                     : 5;
    __IO uint32_t FRG4E                     : 1;
    uint32_t RESERVED24                     : 8;
} stc_mpu_rgcr4_field_t;

typedef struct
{
    __IO uint32_t S2RG5RP                   : 1;
    __IO uint32_t S2RG5WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG5E                    : 1;
    __IO uint32_t S1RG5RP                   : 1;
    __IO uint32_t S1RG5WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG5E                    : 1;
    __IO uint32_t FRG5RP                    : 1;
    __IO uint32_t FRG5WP                    : 1;
    uint32_t RESERVED18                     : 5;
    __IO uint32_t FRG5E                     : 1;
    uint32_t RESERVED24                     : 8;
} stc_mpu_rgcr5_field_t;

