SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pehb_template/common/hc32f460pehb.h
typedef struct
{
    __IO uint32_t S2RG6RP                   : 1;
    __IO uint32_t S2RG6WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG6E                    : 1;
    __IO uint32_t S1RG6RP                   : 1;
    __IO uint32_t S1RG6WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG6E                    : 1;
    __IO uint32_t FRG6RP                    : 1;
    __IO uint32_t FRG6WP                    : 1;
    uint32_t RESERVED18                     : 5;
    __IO uint32_t FRG6E                     : 1;
    uint32_t RESERVED24                     : 8;
} stc_mpu_rgcr6_field_t;

typedef struct
{
    __IO uint32_t S2RG7RP                   : 1;
    __IO uint32_t S2RG7WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG7E                    : 1;
    __IO uint32_t S1RG7RP                   : 1;
    __IO uint32_t S1RG7WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG7E                    : 1;
    __IO uint32_t FRG7RP                    : 1;
    __IO uint32_t FRG7WP                    : 1;
    uint32_t RESERVED18                     : 5;
    __IO uint32_t FRG7E                     : 1;
    uint32_t RESERVED24                     : 8;
} stc_mpu_rgcr7_field_t;

typedef struct
{
    __IO uint32_t S2RG8RP                   : 1;
    __IO uint32_t S2RG8WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG8E                    : 1;
    __IO uint32_t S1RG8RP                   : 1;
    __IO uint32_t S1RG8WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG8E                    : 1;
    uint32_t RESERVED16                     :16;
} stc_mpu_rgcr8_field_t;

typedef struct
{
    __IO uint32_t S2RG9RP                   : 1;
    __IO uint32_t S2RG9WP                   : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG9E                    : 1;
    __IO uint32_t S1RG9RP                   : 1;
    __IO uint32_t S1RG9WP                   : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG9E                    : 1;
    uint32_t RESERVED16                     :16;
} stc_mpu_rgcr9_field_t;

typedef struct
{
    __IO uint32_t S2RG10RP                  : 1;
    __IO uint32_t S2RG10WP                  : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG10E                   : 1;
    __IO uint32_t S1RG10RP                  : 1;
    __IO uint32_t S1RG10WP                  : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG10E                   : 1;
    uint32_t RESERVED16                     :16;
} stc_mpu_rgcr10_field_t;

typedef struct
{
    __IO uint32_t S2RG11RP                  : 1;
    __IO uint32_t S2RG11WP                  : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG11E                   : 1;
    __IO uint32_t S1RG11RP                  : 1;
    __IO uint32_t S1RG11WP                  : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG11E                   : 1;
    uint32_t RESERVED16                     :16;
} stc_mpu_rgcr11_field_t;

typedef struct
{
    __IO uint32_t S2RG12RP                  : 1;
    __IO uint32_t S2RG12WP                  : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG12E                   : 1;
    __IO uint32_t S1RG12RP                  : 1;
    __IO uint32_t S1RG12WP                  : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG12E                   : 1;
    uint32_t RESERVED16                     :16;
} stc_mpu_rgcr12_field_t;

typedef struct
{
    __IO uint32_t S2RG13RP                  : 1;
    __IO uint32_t S2RG13WP                  : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG13E                   : 1;
    __IO uint32_t S1RG13RP                  : 1;
    __IO uint32_t S1RG13WP                  : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG13E                   : 1;
    uint32_t RESERVED16                     :16;
} stc_mpu_rgcr13_field_t;

typedef struct
{
    __IO uint32_t S2RG14RP                  : 1;
    __IO uint32_t S2RG14WP                  : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG14E                   : 1;
    __IO uint32_t S1RG14RP                  : 1;
    __IO uint32_t S1RG14WP                  : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG14E                   : 1;
    uint32_t RESERVED16                     :16;
} stc_mpu_rgcr14_field_t;

typedef struct
{
    __IO uint32_t S2RG15RP                  : 1;
    __IO uint32_t S2RG15WP                  : 1;
    uint32_t RESERVED2                      : 5;
    __IO uint32_t S2RG15E                   : 1;
    __IO uint32_t S1RG15RP                  : 1;
    __IO uint32_t S1RG15WP                  : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t S1RG15E                   : 1;
    uint32_t RESERVED16                     :16;
} stc_mpu_rgcr15_field_t;

typedef struct
{
    __IO uint32_t SMPU2BRP                  : 1;
    __IO uint32_t SMPU2BWP                  : 1;
    __IO uint32_t SMPU2ACT                  : 2;
    uint32_t RESERVED4                      : 3;
    __IO uint32_t SMPU2E                    : 1;
    __IO uint32_t SMPU1BRP                  : 1;
    __IO uint32_t SMPU1BWP                  : 1;
    __IO uint32_t SMPU1ACT                  : 2;
    uint32_t RESERVED12                     : 3;
    __IO uint32_t SMPU1E                    : 1;
    __IO uint32_t FMPUBRP                   : 1;
    __IO uint32_t FMPUBWP                   : 1;
    __IO uint32_t FMPUACT                   : 2;
    uint32_t RESERVED20                     : 3;
    __IO uint32_t FMPUE                     : 1;
    uint32_t RESERVED24                     : 8;
} stc_mpu_cr_field_t;

typedef struct
{
    __IO uint32_t SMPU2EAF                  : 1;
    uint32_t RESERVED1                      : 7;
    __IO uint32_t SMPU1EAF                  : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t FMPUEAF                   : 1;
    uint32_t RESERVED17                     :15;
} stc_mpu_sr_field_t;

typedef struct
{
    __IO uint32_t SMPU2ECLR                 : 1;
    uint32_t RESERVED1                      : 7;
    __IO uint32_t SMPU1ECLR                 : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t FMPUECLR                  : 1;
    uint32_t RESERVED17                     :15;
} stc_mpu_eclr_field_t;

typedef struct
{
    __IO uint32_t MPUWE                     : 1;
    __IO uint32_t WKEY                      :15;
    uint32_t RESERVED16                     :16;
} stc_mpu_wp_field_t;

typedef struct
{
    __IO uint32_t SRAMH                     : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t SRAM12                    : 1;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t SRAM3                     : 1;
    uint32_t RESERVED9                      : 1;
    __IO uint32_t SRAMRET                   : 1;
    uint32_t RESERVED11                     : 3;
    __IO uint32_t DMA1                      : 1;
    __IO uint32_t DMA2                      : 1;
    __IO uint32_t FCM                       : 1;
    __IO uint32_t AOS                       : 1;
    uint32_t RESERVED18                     : 2;
    __IO uint32_t AES                       : 1;
    __IO uint32_t HASH                      : 1;
    __IO uint32_t TRNG                      : 1;
    __IO uint32_t CRC                       : 1;
    __IO uint32_t DCU1                      : 1;
    __IO uint32_t DCU2                      : 1;
    __IO uint32_t DCU3                      : 1;
    __IO uint32_t DCU4                      : 1;
    uint32_t RESERVED28                     : 3;
    __IO uint32_t KEY                       : 1;
} stc_mstp_fcg0_field_t;

typedef struct
{
    __IO uint32_t CAN                       : 1;
    uint32_t RESERVED1                      : 2;
    __IO uint32_t QSPI                      : 1;
    __IO uint32_t IIC1                      : 1;
    __IO uint32_t IIC2                      : 1;
    __IO uint32_t IIC3                      : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t USBFS                     : 1;
    uint32_t RESERVED9                      : 1;
    __IO uint32_t SDIOC1                    : 1;
    __IO uint32_t SDIOC2                    : 1;
    __IO uint32_t I2S1                      : 1;
    __IO uint32_t I2S2                      : 1;
    __IO uint32_t I2S3                      : 1;
    __IO uint32_t I2S4                      : 1;
    __IO uint32_t SPI1                      : 1;
    __IO uint32_t SPI2                      : 1;
    __IO uint32_t SPI3                      : 1;
    __IO uint32_t SPI4                      : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t USART1                    : 1;
    __IO uint32_t USART2                    : 1;
    __IO uint32_t USART3                    : 1;
    __IO uint32_t USART4                    : 1;
    uint32_t RESERVED28                     : 4;
} stc_mstp_fcg1_field_t;

typedef struct
{
    __IO uint32_t TIMER0_1                  : 1;
    __IO uint32_t TIMER0_2                  : 1;
    __IO uint32_t TIMERA_1                  : 1;
    __IO uint32_t TIMERA_2                  : 1;
    __IO uint32_t TIMERA_3                  : 1;
    __IO uint32_t TIMERA_4                  : 1;
    __IO uint32_t TIMERA_5                  : 1;
    __IO uint32_t TIMERA_6                  : 1;
    __IO uint32_t TIMER4_1                  : 1;
    __IO uint32_t TIMER4_2                  : 1;
    __IO uint32_t TIMER4_3                  : 1;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t EMB                       : 1;
    __IO uint32_t TIMER6_1                  : 1;
    __IO uint32_t TIMER6_2                  : 1;
    __IO uint32_t TIMER6_3                  : 1;
    uint32_t RESERVED19                     :13;
} stc_mstp_fcg2_field_t;

typedef struct
{
    __IO uint32_t ADC1                      : 1;
    __IO uint32_t ADC2                      : 1;
    uint32_t RESERVED2                      : 6;
    __IO uint32_t CMP                       : 1;
    uint32_t RESERVED9                      : 3;
    __IO uint32_t OTS                       : 1;
    uint32_t RESERVED13                     :19;
} stc_mstp_fcg3_field_t;

typedef struct
{
    __IO uint32_t PRT0                      : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t FCG0PCWE                  :16;
} stc_mstp_fcg0pc_field_t;

typedef struct
{
    __IO uint16_t OTSST                     : 1;
    __IO uint16_t OTSCK                     : 1;
    __IO uint16_t OTSIE                     : 1;
    __IO uint16_t TSSTP                     : 1;
    uint16_t RESERVED4                      :12;
} stc_ots_ctl_field_t;

typedef struct
{
    __IO uint32_t TSOFS                     : 8;
    __IO uint32_t TSSLP                     :24;
} stc_ots_lpr_field_t;

typedef struct
{
    __IO uint32_t DFB                       : 1;
    __IO uint32_t SOFEN                     : 1;
    uint32_t RESERVED2                      :30;
} stc_peric_usbfs_syctlreg_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t SELMMC1                   : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t SELMMC2                   : 1;
    uint32_t RESERVED4                      :28;
} stc_peric_sdioc_syctlreg_field_t;

typedef struct
{
    __IO uint16_t PIN00                     : 1;
    __IO uint16_t PIN01                     : 1;
    __IO uint16_t PIN02                     : 1;
    __IO uint16_t PIN03                     : 1;
    __IO uint16_t PIN04                     : 1;
    __IO uint16_t PIN05                     : 1;
    __IO uint16_t PIN06                     : 1;
    __IO uint16_t PIN07                     : 1;
    __IO uint16_t PIN08                     : 1;
    __IO uint16_t PIN09                     : 1;
    __IO uint16_t PIN10                     : 1;
    __IO uint16_t PIN11                     : 1;
    __IO uint16_t PIN12                     : 1;
    __IO uint16_t PIN13                     : 1;
    __IO uint16_t PIN14                     : 1;
    __IO uint16_t PIN15                     : 1;
} stc_port_pidr_field_t;

typedef struct
{
    __IO uint16_t POUT00                    : 1;
    __IO uint16_t POUT01                    : 1;
    __IO uint16_t POUT02                    : 1;
    __IO uint16_t POUT03                    : 1;
    __IO uint16_t POUT04                    : 1;
    __IO uint16_t POUT05                    : 1;
    __IO uint16_t POUT06                    : 1;
    __IO uint16_t POUT07                    : 1;
    __IO uint16_t POUT08                    : 1;
    __IO uint16_t POUT09                    : 1;
    __IO uint16_t POUT10                    : 1;
    __IO uint16_t POUT11                    : 1;
    __IO uint16_t POUT12                    : 1;
    __IO uint16_t POUT13                    : 1;
    __IO uint16_t POUT14                    : 1;
    __IO uint16_t POUT15                    : 1;
} stc_port_podr_field_t;

typedef struct
{
    __IO uint16_t POUTE00                   : 1;
    __IO uint16_t POUTE01                   : 1;
    __IO uint16_t POUTE02                   : 1;
    __IO uint16_t POUTE03                   : 1;
    __IO uint16_t POUTE04                   : 1;
    __IO uint16_t POUTE05                   : 1;
    __IO uint16_t POUTE06                   : 1;
    __IO uint16_t POUTE07                   : 1;
    __IO uint16_t POUTE08                   : 1;
    __IO uint16_t POUTE09                   : 1;
    __IO uint16_t POUTE10                   : 1;
    __IO uint16_t POUTE11                   : 1;
    __IO uint16_t POUTE12                   : 1;
    __IO uint16_t POUTE13                   : 1;
    __IO uint16_t POUTE14                   : 1;
    __IO uint16_t POUTE15                   : 1;
} stc_port_poer_field_t;

typedef struct
{
    __IO uint16_t POS00                     : 1;
    __IO uint16_t POS01                     : 1;
    __IO uint16_t POS02                     : 1;
    __IO uint16_t POS03                     : 1;
    __IO uint16_t POS04                     : 1;
    __IO uint16_t POS05                     : 1;
    __IO uint16_t POS06                     : 1;
    __IO uint16_t POS07                     : 1;
    __IO uint16_t POS08                     : 1;
    __IO uint16_t POS09                     : 1;
    __IO uint16_t POS10                     : 1;
    __IO uint16_t POS11                     : 1;
    __IO uint16_t POS12                     : 1;
    __IO uint16_t POS13                     : 1;
    __IO uint16_t POS14                     : 1;
    __IO uint16_t POS15                     : 1;
} stc_port_posr_field_t;

typedef struct
{
    __IO uint16_t POR00                     : 1;
    __IO uint16_t POR01                     : 1;
    __IO uint16_t POR02                     : 1;
    __IO uint16_t POR03                     : 1;
    __IO uint16_t POR04                     : 1;
    __IO uint16_t POR05                     : 1;
    __IO uint16_t POR06                     : 1;
    __IO uint16_t POR07                     : 1;
    __IO uint16_t POR08                     : 1;
    __IO uint16_t POR09                     : 1;
    __IO uint16_t POR10                     : 1;
    __IO uint16_t POR11                     : 1;
    __IO uint16_t POR12                     : 1;
    __IO uint16_t POR13                     : 1;
    __IO uint16_t POR14                     : 1;
    __IO uint16_t POR15                     : 1;
} stc_port_porr_field_t;

typedef struct
{
    __IO uint16_t POT00                     : 1;
    __IO uint16_t POT01                     : 1;
    __IO uint16_t POT02                     : 1;
    __IO uint16_t POT03                     : 1;
    __IO uint16_t POT04                     : 1;
    __IO uint16_t POT05                     : 1;
    __IO uint16_t POT06                     : 1;
    __IO uint16_t POT07                     : 1;
    __IO uint16_t POT08                     : 1;
    __IO uint16_t POT09                     : 1;
    __IO uint16_t POT10                     : 1;
    __IO uint16_t POT11                     : 1;
    __IO uint16_t POT12                     : 1;
    __IO uint16_t POT13                     : 1;
    __IO uint16_t POT14                     : 1;
    __IO uint16_t POT15                     : 1;
} stc_port_potr_field_t;

typedef struct
{
    __IO uint16_t PIN00                     : 1;
    __IO uint16_t PIN01                     : 1;
    __IO uint16_t PIN02                     : 1;
    uint16_t RESERVED3                      :13;
} stc_port_pidrh_field_t;

typedef struct
{
    __IO uint16_t POUT00                    : 1;
    __IO uint16_t POUT01                    : 1;
    __IO uint16_t POUT02                    : 1;
    uint16_t RESERVED3                      :13;
} stc_port_podrh_field_t;

typedef struct
{
    __IO uint16_t POUTE00                   : 1;
    __IO uint16_t POUTE01                   : 1;
    __IO uint16_t POUTE02                   : 1;
    uint16_t RESERVED3                      :13;
} stc_port_poerh_field_t;

typedef struct
{
    __IO uint16_t POS00                     : 1;
    __IO uint16_t POS01                     : 1;
    __IO uint16_t POS02                     : 1;
    uint16_t RESERVED3                      :13;
} stc_port_posrh_field_t;

typedef struct
{
    __IO uint16_t POR00                     : 1;
    __IO uint16_t POR01                     : 1;
    __IO uint16_t POR02                     : 1;
    uint16_t RESERVED3                      :13;
} stc_port_porrh_field_t;

typedef struct
{
    __IO uint16_t POT00                     : 1;
    __IO uint16_t POT01                     : 1;
    __IO uint16_t POT02                     : 1;
    uint16_t RESERVED3                      :13;
} stc_port_potrh_field_t;

typedef struct
{
    __IO uint16_t SPFE                      : 5;
    uint16_t RESERVED5                      :11;
} stc_port_pspcr_field_t;

typedef struct
{
    __IO uint16_t BFSEL                     : 4;
    uint16_t RESERVED4                      :10;
    __IO uint16_t RDWT                      : 2;
} stc_port_pccr_field_t;

typedef struct
{
    __IO uint16_t PINAE                     : 6;
    uint16_t RESERVED6                      :10;
} stc_port_pinaer_field_t;

typedef struct
{
    __IO uint16_t WE                        : 1;
    uint16_t RESERVED1                      : 7;
    __IO uint16_t WP                        : 8;
} stc_port_pwpr_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 1;
    __IO uint16_t LTE                       : 1;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 6;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t BFE                       : 1;
    uint16_t RESERVED9                      : 7;
} stc_port_pfsr_field_t;

typedef struct
{
    __IO uint32_t MDSEL                     : 3;
    __IO uint32_t PFE                       : 1;
    __IO uint32_t PFSAE                     : 1;
    __IO uint32_t DCOME                     : 1;
    __IO uint32_t XIPE                      : 1;
    __IO uint32_t SPIMD3                    : 1;
    __IO uint32_t IPRSL                     : 2;
    __IO uint32_t APRSL                     : 2;
    __IO uint32_t DPRSL                     : 2;
    uint32_t RESERVED14                     : 2;
    __IO uint32_t DIV                       : 6;
    uint32_t RESERVED22                     :10;
} stc_qspi_cr_field_t;

typedef struct
{
    __IO uint32_t SSHW                      : 4;
    __IO uint32_t SSNW                      : 2;
    uint32_t RESERVED6                      :26;
} stc_qspi_cscr_field_t;

typedef struct
{
    __IO uint32_t AWSL                      : 2;
    __IO uint32_t FOUR_BIC                  : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t SSNHD                     : 1;
    __IO uint32_t SSNLD                     : 1;
    __IO uint32_t WPOL                      : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t DMCYCN                    : 4;
    uint32_t RESERVED12                     : 3;
    __IO uint32_t DUTY                      : 1;
    uint32_t RESERVED16                     :16;
} stc_qspi_fcr_field_t;

typedef struct
{
    __IO uint32_t BUSY                      : 1;
    uint32_t RESERVED1                      : 5;
    __IO uint32_t XIPF                      : 1;
    __IO uint32_t RAER                      : 1;
    __IO uint32_t PFNUM                     : 5;
    uint32_t RESERVED13                     : 1;
    __IO uint32_t PFFUL                     : 1;
    __IO uint32_t PFAN                      : 1;
    uint32_t RESERVED16                     :16;
} stc_qspi_sr_field_t;

typedef struct
{
    __IO uint32_t DCOM                      : 8;
    uint32_t RESERVED8                      :24;
} stc_qspi_dcom_field_t;

typedef struct
{
    __IO uint32_t RIC                       : 8;
    uint32_t RESERVED8                      :24;
} stc_qspi_ccmd_field_t;

typedef struct
{
    __IO uint32_t XIPMC                     : 8;
    uint32_t RESERVED8                      :24;
} stc_qspi_xcmd_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 7;
    __IO uint32_t RAERCLR                   : 1;
    uint32_t RESERVED8                      :24;
} stc_qspi_sr2_field_t;

typedef struct
{
    uint32_t RESERVED0                      :26;
    __IO uint32_t EXADR                     : 6;
} stc_qspi_exar_field_t;

typedef struct
{
    __IO uint32_t RESET                     : 1;
    uint32_t RESERVED1                      :31;
} stc_rtc_cr0_field_t;

typedef struct
{
    __IO uint32_t PRDS                      : 3;
    __IO uint32_t AMPM                      : 1;
    __IO uint32_t ALMFCLR                   : 1;
    __IO uint32_t ONEHZOE                   : 1;
    __IO uint32_t ONEHZSEL                  : 1;
    __IO uint32_t START                     : 1;
    uint32_t RESERVED8                      :24;
} stc_rtc_cr1_field_t;

typedef struct
{
    __IO uint32_t RWREQ                     : 1;
    __IO uint32_t RWEN                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t ALMF                      : 1;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t PRDIE                     : 1;
    __IO uint32_t ALMIE                     : 1;
    __IO uint32_t ALME                      : 1;
    uint32_t RESERVED8                      :24;
} stc_rtc_cr2_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t LRCEN                     : 1;
    uint32_t RESERVED5                      : 2;
    __IO uint32_t RCKSEL                    : 1;
    uint32_t RESERVED8                      :24;
} stc_rtc_cr3_field_t;

typedef struct
{
    __IO uint32_t SECU                      : 4;
    __IO uint32_t SECD                      : 3;
    uint32_t RESERVED7                      :25;
} stc_rtc_sec_field_t;

