SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pehb_template/common/hc32f460pehb.h
#define bM4_DMA1_CH0CTL_HSIZE0                    (*((volatile unsigned int*)(0x42A60BA0UL)))
#define bM4_DMA1_CH0CTL_HSIZE1                    (*((volatile unsigned int*)(0x42A60BA4UL)))
#define bM4_DMA1_CH0CTL_LLPEN                     (*((volatile unsigned int*)(0x42A60BA8UL)))
#define bM4_DMA1_CH0CTL_LLPRUN                    (*((volatile unsigned int*)(0x42A60BACUL)))
#define bM4_DMA1_CH0CTL_IE                        (*((volatile unsigned int*)(0x42A60BB0UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE0               (*((volatile unsigned int*)(0x42A60D00UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE1               (*((volatile unsigned int*)(0x42A60D04UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE2               (*((volatile unsigned int*)(0x42A60D08UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE3               (*((volatile unsigned int*)(0x42A60D0CUL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE4               (*((volatile unsigned int*)(0x42A60D10UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE5               (*((volatile unsigned int*)(0x42A60D14UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE6               (*((volatile unsigned int*)(0x42A60D18UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE7               (*((volatile unsigned int*)(0x42A60D1CUL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE8               (*((volatile unsigned int*)(0x42A60D20UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE9               (*((volatile unsigned int*)(0x42A60D24UL)))
#define bM4_DMA1_MONDTCTL0_CNT0                   (*((volatile unsigned int*)(0x42A60D40UL)))
#define bM4_DMA1_MONDTCTL0_CNT1                   (*((volatile unsigned int*)(0x42A60D44UL)))
#define bM4_DMA1_MONDTCTL0_CNT2                   (*((volatile unsigned int*)(0x42A60D48UL)))
#define bM4_DMA1_MONDTCTL0_CNT3                   (*((volatile unsigned int*)(0x42A60D4CUL)))
#define bM4_DMA1_MONDTCTL0_CNT4                   (*((volatile unsigned int*)(0x42A60D50UL)))
#define bM4_DMA1_MONDTCTL0_CNT5                   (*((volatile unsigned int*)(0x42A60D54UL)))
#define bM4_DMA1_MONDTCTL0_CNT6                   (*((volatile unsigned int*)(0x42A60D58UL)))
#define bM4_DMA1_MONDTCTL0_CNT7                   (*((volatile unsigned int*)(0x42A60D5CUL)))
#define bM4_DMA1_MONDTCTL0_CNT8                   (*((volatile unsigned int*)(0x42A60D60UL)))
#define bM4_DMA1_MONDTCTL0_CNT9                   (*((volatile unsigned int*)(0x42A60D64UL)))
#define bM4_DMA1_MONDTCTL0_CNT10                  (*((volatile unsigned int*)(0x42A60D68UL)))
#define bM4_DMA1_MONDTCTL0_CNT11                  (*((volatile unsigned int*)(0x42A60D6CUL)))
#define bM4_DMA1_MONDTCTL0_CNT12                  (*((volatile unsigned int*)(0x42A60D70UL)))
#define bM4_DMA1_MONDTCTL0_CNT13                  (*((volatile unsigned int*)(0x42A60D74UL)))
#define bM4_DMA1_MONDTCTL0_CNT14                  (*((volatile unsigned int*)(0x42A60D78UL)))
#define bM4_DMA1_MONDTCTL0_CNT15                  (*((volatile unsigned int*)(0x42A60D7CUL)))
#define bM4_DMA1_MONRPT0_SRPT0                    (*((volatile unsigned int*)(0x42A60D80UL)))
#define bM4_DMA1_MONRPT0_SRPT1                    (*((volatile unsigned int*)(0x42A60D84UL)))
#define bM4_DMA1_MONRPT0_SRPT2                    (*((volatile unsigned int*)(0x42A60D88UL)))
#define bM4_DMA1_MONRPT0_SRPT3                    (*((volatile unsigned int*)(0x42A60D8CUL)))
#define bM4_DMA1_MONRPT0_SRPT4                    (*((volatile unsigned int*)(0x42A60D90UL)))
#define bM4_DMA1_MONRPT0_SRPT5                    (*((volatile unsigned int*)(0x42A60D94UL)))
#define bM4_DMA1_MONRPT0_SRPT6                    (*((volatile unsigned int*)(0x42A60D98UL)))
#define bM4_DMA1_MONRPT0_SRPT7                    (*((volatile unsigned int*)(0x42A60D9CUL)))
#define bM4_DMA1_MONRPT0_SRPT8                    (*((volatile unsigned int*)(0x42A60DA0UL)))
#define bM4_DMA1_MONRPT0_SRPT9                    (*((volatile unsigned int*)(0x42A60DA4UL)))
#define bM4_DMA1_MONRPT0_DRPT0                    (*((volatile unsigned int*)(0x42A60DC0UL)))
#define bM4_DMA1_MONRPT0_DRPT1                    (*((volatile unsigned int*)(0x42A60DC4UL)))
#define bM4_DMA1_MONRPT0_DRPT2                    (*((volatile unsigned int*)(0x42A60DC8UL)))
#define bM4_DMA1_MONRPT0_DRPT3                    (*((volatile unsigned int*)(0x42A60DCCUL)))
#define bM4_DMA1_MONRPT0_DRPT4                    (*((volatile unsigned int*)(0x42A60DD0UL)))
#define bM4_DMA1_MONRPT0_DRPT5                    (*((volatile unsigned int*)(0x42A60DD4UL)))
#define bM4_DMA1_MONRPT0_DRPT6                    (*((volatile unsigned int*)(0x42A60DD8UL)))
#define bM4_DMA1_MONRPT0_DRPT7                    (*((volatile unsigned int*)(0x42A60DDCUL)))
#define bM4_DMA1_MONRPT0_DRPT8                    (*((volatile unsigned int*)(0x42A60DE0UL)))
#define bM4_DMA1_MONRPT0_DRPT9                    (*((volatile unsigned int*)(0x42A60DE4UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET0            (*((volatile unsigned int*)(0x42A60E00UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET1            (*((volatile unsigned int*)(0x42A60E04UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET2            (*((volatile unsigned int*)(0x42A60E08UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET3            (*((volatile unsigned int*)(0x42A60E0CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET4            (*((volatile unsigned int*)(0x42A60E10UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET5            (*((volatile unsigned int*)(0x42A60E14UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET6            (*((volatile unsigned int*)(0x42A60E18UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET7            (*((volatile unsigned int*)(0x42A60E1CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET8            (*((volatile unsigned int*)(0x42A60E20UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET9            (*((volatile unsigned int*)(0x42A60E24UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET10           (*((volatile unsigned int*)(0x42A60E28UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET11           (*((volatile unsigned int*)(0x42A60E2CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET12           (*((volatile unsigned int*)(0x42A60E30UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET13           (*((volatile unsigned int*)(0x42A60E34UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET14           (*((volatile unsigned int*)(0x42A60E38UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET15           (*((volatile unsigned int*)(0x42A60E3CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET16           (*((volatile unsigned int*)(0x42A60E40UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET17           (*((volatile unsigned int*)(0x42A60E44UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET18           (*((volatile unsigned int*)(0x42A60E48UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET19           (*((volatile unsigned int*)(0x42A60E4CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT0             (*((volatile unsigned int*)(0x42A60E50UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT1             (*((volatile unsigned int*)(0x42A60E54UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT2             (*((volatile unsigned int*)(0x42A60E58UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT3             (*((volatile unsigned int*)(0x42A60E5CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT4             (*((volatile unsigned int*)(0x42A60E60UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT5             (*((volatile unsigned int*)(0x42A60E64UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT6             (*((volatile unsigned int*)(0x42A60E68UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT7             (*((volatile unsigned int*)(0x42A60E6CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT8             (*((volatile unsigned int*)(0x42A60E70UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT9             (*((volatile unsigned int*)(0x42A60E74UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT10            (*((volatile unsigned int*)(0x42A60E78UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT11            (*((volatile unsigned int*)(0x42A60E7CUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET0            (*((volatile unsigned int*)(0x42A60E80UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET1            (*((volatile unsigned int*)(0x42A60E84UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET2            (*((volatile unsigned int*)(0x42A60E88UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET3            (*((volatile unsigned int*)(0x42A60E8CUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET4            (*((volatile unsigned int*)(0x42A60E90UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET5            (*((volatile unsigned int*)(0x42A60E94UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET6            (*((volatile unsigned int*)(0x42A60E98UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET7            (*((volatile unsigned int*)(0x42A60E9CUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET8            (*((volatile unsigned int*)(0x42A60EA0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET9            (*((volatile unsigned int*)(0x42A60EA4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET10           (*((volatile unsigned int*)(0x42A60EA8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET11           (*((volatile unsigned int*)(0x42A60EACUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET12           (*((volatile unsigned int*)(0x42A60EB0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET13           (*((volatile unsigned int*)(0x42A60EB4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET14           (*((volatile unsigned int*)(0x42A60EB8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET15           (*((volatile unsigned int*)(0x42A60EBCUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET16           (*((volatile unsigned int*)(0x42A60EC0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET17           (*((volatile unsigned int*)(0x42A60EC4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET18           (*((volatile unsigned int*)(0x42A60EC8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET19           (*((volatile unsigned int*)(0x42A60ECCUL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT0             (*((volatile unsigned int*)(0x42A60ED0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT1             (*((volatile unsigned int*)(0x42A60ED4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT2             (*((volatile unsigned int*)(0x42A60ED8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT3             (*((volatile unsigned int*)(0x42A60EDCUL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT4             (*((volatile unsigned int*)(0x42A60EE0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT5             (*((volatile unsigned int*)(0x42A60EE4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT6             (*((volatile unsigned int*)(0x42A60EE8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT7             (*((volatile unsigned int*)(0x42A60EECUL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT8             (*((volatile unsigned int*)(0x42A60EF0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT9             (*((volatile unsigned int*)(0x42A60EF4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT10            (*((volatile unsigned int*)(0x42A60EF8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT11            (*((volatile unsigned int*)(0x42A60EFCUL)))
#define bM4_DMA1_DTCTL1_BLKSIZE0                  (*((volatile unsigned int*)(0x42A61100UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE1                  (*((volatile unsigned int*)(0x42A61104UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE2                  (*((volatile unsigned int*)(0x42A61108UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE3                  (*((volatile unsigned int*)(0x42A6110CUL)))
#define bM4_DMA1_DTCTL1_BLKSIZE4                  (*((volatile unsigned int*)(0x42A61110UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE5                  (*((volatile unsigned int*)(0x42A61114UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE6                  (*((volatile unsigned int*)(0x42A61118UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE7                  (*((volatile unsigned int*)(0x42A6111CUL)))
#define bM4_DMA1_DTCTL1_BLKSIZE8                  (*((volatile unsigned int*)(0x42A61120UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE9                  (*((volatile unsigned int*)(0x42A61124UL)))
#define bM4_DMA1_DTCTL1_CNT0                      (*((volatile unsigned int*)(0x42A61140UL)))
#define bM4_DMA1_DTCTL1_CNT1                      (*((volatile unsigned int*)(0x42A61144UL)))
#define bM4_DMA1_DTCTL1_CNT2                      (*((volatile unsigned int*)(0x42A61148UL)))
#define bM4_DMA1_DTCTL1_CNT3                      (*((volatile unsigned int*)(0x42A6114CUL)))
#define bM4_DMA1_DTCTL1_CNT4                      (*((volatile unsigned int*)(0x42A61150UL)))
#define bM4_DMA1_DTCTL1_CNT5                      (*((volatile unsigned int*)(0x42A61154UL)))
#define bM4_DMA1_DTCTL1_CNT6                      (*((volatile unsigned int*)(0x42A61158UL)))
#define bM4_DMA1_DTCTL1_CNT7                      (*((volatile unsigned int*)(0x42A6115CUL)))
#define bM4_DMA1_DTCTL1_CNT8                      (*((volatile unsigned int*)(0x42A61160UL)))
#define bM4_DMA1_DTCTL1_CNT9                      (*((volatile unsigned int*)(0x42A61164UL)))
#define bM4_DMA1_DTCTL1_CNT10                     (*((volatile unsigned int*)(0x42A61168UL)))
#define bM4_DMA1_DTCTL1_CNT11                     (*((volatile unsigned int*)(0x42A6116CUL)))
#define bM4_DMA1_DTCTL1_CNT12                     (*((volatile unsigned int*)(0x42A61170UL)))
#define bM4_DMA1_DTCTL1_CNT13                     (*((volatile unsigned int*)(0x42A61174UL)))
#define bM4_DMA1_DTCTL1_CNT14                     (*((volatile unsigned int*)(0x42A61178UL)))
#define bM4_DMA1_DTCTL1_CNT15                     (*((volatile unsigned int*)(0x42A6117CUL)))
#define bM4_DMA1_RPT1_SRPT0                       (*((volatile unsigned int*)(0x42A61180UL)))
#define bM4_DMA1_RPT1_SRPT1                       (*((volatile unsigned int*)(0x42A61184UL)))
#define bM4_DMA1_RPT1_SRPT2                       (*((volatile unsigned int*)(0x42A61188UL)))
#define bM4_DMA1_RPT1_SRPT3                       (*((volatile unsigned int*)(0x42A6118CUL)))
#define bM4_DMA1_RPT1_SRPT4                       (*((volatile unsigned int*)(0x42A61190UL)))
#define bM4_DMA1_RPT1_SRPT5                       (*((volatile unsigned int*)(0x42A61194UL)))
#define bM4_DMA1_RPT1_SRPT6                       (*((volatile unsigned int*)(0x42A61198UL)))
#define bM4_DMA1_RPT1_SRPT7                       (*((volatile unsigned int*)(0x42A6119CUL)))
#define bM4_DMA1_RPT1_SRPT8                       (*((volatile unsigned int*)(0x42A611A0UL)))
#define bM4_DMA1_RPT1_SRPT9                       (*((volatile unsigned int*)(0x42A611A4UL)))
#define bM4_DMA1_RPT1_DRPT0                       (*((volatile unsigned int*)(0x42A611C0UL)))
#define bM4_DMA1_RPT1_DRPT1                       (*((volatile unsigned int*)(0x42A611C4UL)))
#define bM4_DMA1_RPT1_DRPT2                       (*((volatile unsigned int*)(0x42A611C8UL)))
#define bM4_DMA1_RPT1_DRPT3                       (*((volatile unsigned int*)(0x42A611CCUL)))
#define bM4_DMA1_RPT1_DRPT4                       (*((volatile unsigned int*)(0x42A611D0UL)))
#define bM4_DMA1_RPT1_DRPT5                       (*((volatile unsigned int*)(0x42A611D4UL)))
#define bM4_DMA1_RPT1_DRPT6                       (*((volatile unsigned int*)(0x42A611D8UL)))
#define bM4_DMA1_RPT1_DRPT7                       (*((volatile unsigned int*)(0x42A611DCUL)))
#define bM4_DMA1_RPT1_DRPT8                       (*((volatile unsigned int*)(0x42A611E0UL)))
#define bM4_DMA1_RPT1_DRPT9                       (*((volatile unsigned int*)(0x42A611E4UL)))
#define bM4_DMA1_RPTB1_SRPTB0                     (*((volatile unsigned int*)(0x42A61180UL)))
#define bM4_DMA1_RPTB1_SRPTB1                     (*((volatile unsigned int*)(0x42A61184UL)))
#define bM4_DMA1_RPTB1_SRPTB2                     (*((volatile unsigned int*)(0x42A61188UL)))
#define bM4_DMA1_RPTB1_SRPTB3                     (*((volatile unsigned int*)(0x42A6118CUL)))
#define bM4_DMA1_RPTB1_SRPTB4                     (*((volatile unsigned int*)(0x42A61190UL)))
#define bM4_DMA1_RPTB1_SRPTB5                     (*((volatile unsigned int*)(0x42A61194UL)))
#define bM4_DMA1_RPTB1_SRPTB6                     (*((volatile unsigned int*)(0x42A61198UL)))
#define bM4_DMA1_RPTB1_SRPTB7                     (*((volatile unsigned int*)(0x42A6119CUL)))
#define bM4_DMA1_RPTB1_SRPTB8                     (*((volatile unsigned int*)(0x42A611A0UL)))
#define bM4_DMA1_RPTB1_SRPTB9                     (*((volatile unsigned int*)(0x42A611A4UL)))
#define bM4_DMA1_RPTB1_DRPTB0                     (*((volatile unsigned int*)(0x42A611C0UL)))
#define bM4_DMA1_RPTB1_DRPTB1                     (*((volatile unsigned int*)(0x42A611C4UL)))
#define bM4_DMA1_RPTB1_DRPTB2                     (*((volatile unsigned int*)(0x42A611C8UL)))
#define bM4_DMA1_RPTB1_DRPTB3                     (*((volatile unsigned int*)(0x42A611CCUL)))
#define bM4_DMA1_RPTB1_DRPTB4                     (*((volatile unsigned int*)(0x42A611D0UL)))
#define bM4_DMA1_RPTB1_DRPTB5                     (*((volatile unsigned int*)(0x42A611D4UL)))
#define bM4_DMA1_RPTB1_DRPTB6                     (*((volatile unsigned int*)(0x42A611D8UL)))
#define bM4_DMA1_RPTB1_DRPTB7                     (*((volatile unsigned int*)(0x42A611DCUL)))
#define bM4_DMA1_RPTB1_DRPTB8                     (*((volatile unsigned int*)(0x42A611E0UL)))
#define bM4_DMA1_RPTB1_DRPTB9                     (*((volatile unsigned int*)(0x42A611E4UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET0               (*((volatile unsigned int*)(0x42A61200UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET1               (*((volatile unsigned int*)(0x42A61204UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET2               (*((volatile unsigned int*)(0x42A61208UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET3               (*((volatile unsigned int*)(0x42A6120CUL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET4               (*((volatile unsigned int*)(0x42A61210UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET5               (*((volatile unsigned int*)(0x42A61214UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET6               (*((volatile unsigned int*)(0x42A61218UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET7               (*((volatile unsigned int*)(0x42A6121CUL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET8               (*((volatile unsigned int*)(0x42A61220UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET9               (*((volatile unsigned int*)(0x42A61224UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET10              (*((volatile unsigned int*)(0x42A61228UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET11              (*((volatile unsigned int*)(0x42A6122CUL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET12              (*((volatile unsigned int*)(0x42A61230UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET13              (*((volatile unsigned int*)(0x42A61234UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET14              (*((volatile unsigned int*)(0x42A61238UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET15              (*((volatile unsigned int*)(0x42A6123CUL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET16              (*((volatile unsigned int*)(0x42A61240UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET17              (*((volatile unsigned int*)(0x42A61244UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET18              (*((volatile unsigned int*)(0x42A61248UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET19              (*((volatile unsigned int*)(0x42A6124CUL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT0                (*((volatile unsigned int*)(0x42A61250UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT1                (*((volatile unsigned int*)(0x42A61254UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT2                (*((volatile unsigned int*)(0x42A61258UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT3                (*((volatile unsigned int*)(0x42A6125CUL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT4                (*((volatile unsigned int*)(0x42A61260UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT5                (*((volatile unsigned int*)(0x42A61264UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT6                (*((volatile unsigned int*)(0x42A61268UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT7                (*((volatile unsigned int*)(0x42A6126CUL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT8                (*((volatile unsigned int*)(0x42A61270UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT9                (*((volatile unsigned int*)(0x42A61274UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT10               (*((volatile unsigned int*)(0x42A61278UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT11               (*((volatile unsigned int*)(0x42A6127CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST0              (*((volatile unsigned int*)(0x42A61200UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST1              (*((volatile unsigned int*)(0x42A61204UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST2              (*((volatile unsigned int*)(0x42A61208UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST3              (*((volatile unsigned int*)(0x42A6120CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST4              (*((volatile unsigned int*)(0x42A61210UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST5              (*((volatile unsigned int*)(0x42A61214UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST6              (*((volatile unsigned int*)(0x42A61218UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST7              (*((volatile unsigned int*)(0x42A6121CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST8              (*((volatile unsigned int*)(0x42A61220UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST9              (*((volatile unsigned int*)(0x42A61224UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST10             (*((volatile unsigned int*)(0x42A61228UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST11             (*((volatile unsigned int*)(0x42A6122CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST12             (*((volatile unsigned int*)(0x42A61230UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST13             (*((volatile unsigned int*)(0x42A61234UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST14             (*((volatile unsigned int*)(0x42A61238UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST15             (*((volatile unsigned int*)(0x42A6123CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST16             (*((volatile unsigned int*)(0x42A61240UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST17             (*((volatile unsigned int*)(0x42A61244UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST18             (*((volatile unsigned int*)(0x42A61248UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST19             (*((volatile unsigned int*)(0x42A6124CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB0              (*((volatile unsigned int*)(0x42A61250UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB1              (*((volatile unsigned int*)(0x42A61254UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB2              (*((volatile unsigned int*)(0x42A61258UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB3              (*((volatile unsigned int*)(0x42A6125CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB4              (*((volatile unsigned int*)(0x42A61260UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB5              (*((volatile unsigned int*)(0x42A61264UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB6              (*((volatile unsigned int*)(0x42A61268UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB7              (*((volatile unsigned int*)(0x42A6126CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB8              (*((volatile unsigned int*)(0x42A61270UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB9              (*((volatile unsigned int*)(0x42A61274UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB10             (*((volatile unsigned int*)(0x42A61278UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB11             (*((volatile unsigned int*)(0x42A6127CUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET0               (*((volatile unsigned int*)(0x42A61280UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET1               (*((volatile unsigned int*)(0x42A61284UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET2               (*((volatile unsigned int*)(0x42A61288UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET3               (*((volatile unsigned int*)(0x42A6128CUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET4               (*((volatile unsigned int*)(0x42A61290UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET5               (*((volatile unsigned int*)(0x42A61294UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET6               (*((volatile unsigned int*)(0x42A61298UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET7               (*((volatile unsigned int*)(0x42A6129CUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET8               (*((volatile unsigned int*)(0x42A612A0UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET9               (*((volatile unsigned int*)(0x42A612A4UL)))
