SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pehb_template/common/hc32f460pehb.h
#define bM4_PORT_PFSRE7_FSEL1                     (*((volatile unsigned int*)(0x42A7A3C4UL)))
#define bM4_PORT_PFSRE7_FSEL2                     (*((volatile unsigned int*)(0x42A7A3C8UL)))
#define bM4_PORT_PFSRE7_FSEL3                     (*((volatile unsigned int*)(0x42A7A3CCUL)))
#define bM4_PORT_PFSRE7_FSEL4                     (*((volatile unsigned int*)(0x42A7A3D0UL)))
#define bM4_PORT_PFSRE7_FSEL5                     (*((volatile unsigned int*)(0x42A7A3D4UL)))
#define bM4_PORT_PFSRE7_BFE                       (*((volatile unsigned int*)(0x42A7A3E0UL)))
#define bM4_PORT_PCRE8_POUT                       (*((volatile unsigned int*)(0x42A7A400UL)))
#define bM4_PORT_PCRE8_POUTE                      (*((volatile unsigned int*)(0x42A7A404UL)))
#define bM4_PORT_PCRE8_NOD                        (*((volatile unsigned int*)(0x42A7A408UL)))
#define bM4_PORT_PCRE8_DRV0                       (*((volatile unsigned int*)(0x42A7A410UL)))
#define bM4_PORT_PCRE8_DRV1                       (*((volatile unsigned int*)(0x42A7A414UL)))
#define bM4_PORT_PCRE8_PUU                        (*((volatile unsigned int*)(0x42A7A418UL)))
#define bM4_PORT_PCRE8_PIN                        (*((volatile unsigned int*)(0x42A7A420UL)))
#define bM4_PORT_PCRE8_INVE                       (*((volatile unsigned int*)(0x42A7A424UL)))
#define bM4_PORT_PCRE8_INTE                       (*((volatile unsigned int*)(0x42A7A430UL)))
#define bM4_PORT_PCRE8_LTE                        (*((volatile unsigned int*)(0x42A7A438UL)))
#define bM4_PORT_PCRE8_DDIS                       (*((volatile unsigned int*)(0x42A7A43CUL)))
#define bM4_PORT_PFSRE8_FSEL0                     (*((volatile unsigned int*)(0x42A7A440UL)))
#define bM4_PORT_PFSRE8_FSEL1                     (*((volatile unsigned int*)(0x42A7A444UL)))
#define bM4_PORT_PFSRE8_FSEL2                     (*((volatile unsigned int*)(0x42A7A448UL)))
#define bM4_PORT_PFSRE8_FSEL3                     (*((volatile unsigned int*)(0x42A7A44CUL)))
#define bM4_PORT_PFSRE8_FSEL4                     (*((volatile unsigned int*)(0x42A7A450UL)))
#define bM4_PORT_PFSRE8_FSEL5                     (*((volatile unsigned int*)(0x42A7A454UL)))
#define bM4_PORT_PFSRE8_BFE                       (*((volatile unsigned int*)(0x42A7A460UL)))
#define bM4_PORT_PCRE9_POUT                       (*((volatile unsigned int*)(0x42A7A480UL)))
#define bM4_PORT_PCRE9_POUTE                      (*((volatile unsigned int*)(0x42A7A484UL)))
#define bM4_PORT_PCRE9_NOD                        (*((volatile unsigned int*)(0x42A7A488UL)))
#define bM4_PORT_PCRE9_DRV0                       (*((volatile unsigned int*)(0x42A7A490UL)))
#define bM4_PORT_PCRE9_DRV1                       (*((volatile unsigned int*)(0x42A7A494UL)))
#define bM4_PORT_PCRE9_PUU                        (*((volatile unsigned int*)(0x42A7A498UL)))
#define bM4_PORT_PCRE9_PIN                        (*((volatile unsigned int*)(0x42A7A4A0UL)))
#define bM4_PORT_PCRE9_INVE                       (*((volatile unsigned int*)(0x42A7A4A4UL)))
#define bM4_PORT_PCRE9_INTE                       (*((volatile unsigned int*)(0x42A7A4B0UL)))
#define bM4_PORT_PCRE9_LTE                        (*((volatile unsigned int*)(0x42A7A4B8UL)))
#define bM4_PORT_PCRE9_DDIS                       (*((volatile unsigned int*)(0x42A7A4BCUL)))
#define bM4_PORT_PFSRE9_FSEL0                     (*((volatile unsigned int*)(0x42A7A4C0UL)))
#define bM4_PORT_PFSRE9_FSEL1                     (*((volatile unsigned int*)(0x42A7A4C4UL)))
#define bM4_PORT_PFSRE9_FSEL2                     (*((volatile unsigned int*)(0x42A7A4C8UL)))
#define bM4_PORT_PFSRE9_FSEL3                     (*((volatile unsigned int*)(0x42A7A4CCUL)))
#define bM4_PORT_PFSRE9_FSEL4                     (*((volatile unsigned int*)(0x42A7A4D0UL)))
#define bM4_PORT_PFSRE9_FSEL5                     (*((volatile unsigned int*)(0x42A7A4D4UL)))
#define bM4_PORT_PFSRE9_BFE                       (*((volatile unsigned int*)(0x42A7A4E0UL)))
#define bM4_PORT_PCRE10_POUT                      (*((volatile unsigned int*)(0x42A7A500UL)))
#define bM4_PORT_PCRE10_POUTE                     (*((volatile unsigned int*)(0x42A7A504UL)))
#define bM4_PORT_PCRE10_NOD                       (*((volatile unsigned int*)(0x42A7A508UL)))
#define bM4_PORT_PCRE10_DRV0                      (*((volatile unsigned int*)(0x42A7A510UL)))
#define bM4_PORT_PCRE10_DRV1                      (*((volatile unsigned int*)(0x42A7A514UL)))
#define bM4_PORT_PCRE10_PUU                       (*((volatile unsigned int*)(0x42A7A518UL)))
#define bM4_PORT_PCRE10_PIN                       (*((volatile unsigned int*)(0x42A7A520UL)))
#define bM4_PORT_PCRE10_INVE                      (*((volatile unsigned int*)(0x42A7A524UL)))
#define bM4_PORT_PCRE10_INTE                      (*((volatile unsigned int*)(0x42A7A530UL)))
#define bM4_PORT_PCRE10_LTE                       (*((volatile unsigned int*)(0x42A7A538UL)))
#define bM4_PORT_PCRE10_DDIS                      (*((volatile unsigned int*)(0x42A7A53CUL)))
#define bM4_PORT_PFSRE10_FSEL0                    (*((volatile unsigned int*)(0x42A7A540UL)))
#define bM4_PORT_PFSRE10_FSEL1                    (*((volatile unsigned int*)(0x42A7A544UL)))
#define bM4_PORT_PFSRE10_FSEL2                    (*((volatile unsigned int*)(0x42A7A548UL)))
#define bM4_PORT_PFSRE10_FSEL3                    (*((volatile unsigned int*)(0x42A7A54CUL)))
#define bM4_PORT_PFSRE10_FSEL4                    (*((volatile unsigned int*)(0x42A7A550UL)))
#define bM4_PORT_PFSRE10_FSEL5                    (*((volatile unsigned int*)(0x42A7A554UL)))
#define bM4_PORT_PFSRE10_BFE                      (*((volatile unsigned int*)(0x42A7A560UL)))
#define bM4_PORT_PCRE11_POUT                      (*((volatile unsigned int*)(0x42A7A580UL)))
#define bM4_PORT_PCRE11_POUTE                     (*((volatile unsigned int*)(0x42A7A584UL)))
#define bM4_PORT_PCRE11_NOD                       (*((volatile unsigned int*)(0x42A7A588UL)))
#define bM4_PORT_PCRE11_DRV0                      (*((volatile unsigned int*)(0x42A7A590UL)))
#define bM4_PORT_PCRE11_DRV1                      (*((volatile unsigned int*)(0x42A7A594UL)))
#define bM4_PORT_PCRE11_PUU                       (*((volatile unsigned int*)(0x42A7A598UL)))
#define bM4_PORT_PCRE11_PIN                       (*((volatile unsigned int*)(0x42A7A5A0UL)))
#define bM4_PORT_PCRE11_INVE                      (*((volatile unsigned int*)(0x42A7A5A4UL)))
#define bM4_PORT_PCRE11_INTE                      (*((volatile unsigned int*)(0x42A7A5B0UL)))
#define bM4_PORT_PCRE11_LTE                       (*((volatile unsigned int*)(0x42A7A5B8UL)))
#define bM4_PORT_PCRE11_DDIS                      (*((volatile unsigned int*)(0x42A7A5BCUL)))
#define bM4_PORT_PFSRE11_FSEL0                    (*((volatile unsigned int*)(0x42A7A5C0UL)))
#define bM4_PORT_PFSRE11_FSEL1                    (*((volatile unsigned int*)(0x42A7A5C4UL)))
#define bM4_PORT_PFSRE11_FSEL2                    (*((volatile unsigned int*)(0x42A7A5C8UL)))
#define bM4_PORT_PFSRE11_FSEL3                    (*((volatile unsigned int*)(0x42A7A5CCUL)))
#define bM4_PORT_PFSRE11_FSEL4                    (*((volatile unsigned int*)(0x42A7A5D0UL)))
#define bM4_PORT_PFSRE11_FSEL5                    (*((volatile unsigned int*)(0x42A7A5D4UL)))
#define bM4_PORT_PFSRE11_BFE                      (*((volatile unsigned int*)(0x42A7A5E0UL)))
#define bM4_PORT_PCRE12_POUT                      (*((volatile unsigned int*)(0x42A7A600UL)))
#define bM4_PORT_PCRE12_POUTE                     (*((volatile unsigned int*)(0x42A7A604UL)))
#define bM4_PORT_PCRE12_NOD                       (*((volatile unsigned int*)(0x42A7A608UL)))
#define bM4_PORT_PCRE12_DRV0                      (*((volatile unsigned int*)(0x42A7A610UL)))
#define bM4_PORT_PCRE12_DRV1                      (*((volatile unsigned int*)(0x42A7A614UL)))
#define bM4_PORT_PCRE12_PUU                       (*((volatile unsigned int*)(0x42A7A618UL)))
#define bM4_PORT_PCRE12_PIN                       (*((volatile unsigned int*)(0x42A7A620UL)))
#define bM4_PORT_PCRE12_INVE                      (*((volatile unsigned int*)(0x42A7A624UL)))
#define bM4_PORT_PCRE12_INTE                      (*((volatile unsigned int*)(0x42A7A630UL)))
#define bM4_PORT_PCRE12_LTE                       (*((volatile unsigned int*)(0x42A7A638UL)))
#define bM4_PORT_PCRE12_DDIS                      (*((volatile unsigned int*)(0x42A7A63CUL)))
#define bM4_PORT_PFSRE12_FSEL0                    (*((volatile unsigned int*)(0x42A7A640UL)))
#define bM4_PORT_PFSRE12_FSEL1                    (*((volatile unsigned int*)(0x42A7A644UL)))
#define bM4_PORT_PFSRE12_FSEL2                    (*((volatile unsigned int*)(0x42A7A648UL)))
#define bM4_PORT_PFSRE12_FSEL3                    (*((volatile unsigned int*)(0x42A7A64CUL)))
#define bM4_PORT_PFSRE12_FSEL4                    (*((volatile unsigned int*)(0x42A7A650UL)))
#define bM4_PORT_PFSRE12_FSEL5                    (*((volatile unsigned int*)(0x42A7A654UL)))
#define bM4_PORT_PFSRE12_BFE                      (*((volatile unsigned int*)(0x42A7A660UL)))
#define bM4_PORT_PCRE13_POUT                      (*((volatile unsigned int*)(0x42A7A680UL)))
#define bM4_PORT_PCRE13_POUTE                     (*((volatile unsigned int*)(0x42A7A684UL)))
#define bM4_PORT_PCRE13_NOD                       (*((volatile unsigned int*)(0x42A7A688UL)))
#define bM4_PORT_PCRE13_DRV0                      (*((volatile unsigned int*)(0x42A7A690UL)))
#define bM4_PORT_PCRE13_DRV1                      (*((volatile unsigned int*)(0x42A7A694UL)))
#define bM4_PORT_PCRE13_PUU                       (*((volatile unsigned int*)(0x42A7A698UL)))
#define bM4_PORT_PCRE13_PIN                       (*((volatile unsigned int*)(0x42A7A6A0UL)))
#define bM4_PORT_PCRE13_INVE                      (*((volatile unsigned int*)(0x42A7A6A4UL)))
#define bM4_PORT_PCRE13_INTE                      (*((volatile unsigned int*)(0x42A7A6B0UL)))
#define bM4_PORT_PCRE13_LTE                       (*((volatile unsigned int*)(0x42A7A6B8UL)))
#define bM4_PORT_PCRE13_DDIS                      (*((volatile unsigned int*)(0x42A7A6BCUL)))
#define bM4_PORT_PFSRE13_FSEL0                    (*((volatile unsigned int*)(0x42A7A6C0UL)))
#define bM4_PORT_PFSRE13_FSEL1                    (*((volatile unsigned int*)(0x42A7A6C4UL)))
#define bM4_PORT_PFSRE13_FSEL2                    (*((volatile unsigned int*)(0x42A7A6C8UL)))
#define bM4_PORT_PFSRE13_FSEL3                    (*((volatile unsigned int*)(0x42A7A6CCUL)))
#define bM4_PORT_PFSRE13_FSEL4                    (*((volatile unsigned int*)(0x42A7A6D0UL)))
#define bM4_PORT_PFSRE13_FSEL5                    (*((volatile unsigned int*)(0x42A7A6D4UL)))
#define bM4_PORT_PFSRE13_BFE                      (*((volatile unsigned int*)(0x42A7A6E0UL)))
#define bM4_PORT_PCRE14_POUT                      (*((volatile unsigned int*)(0x42A7A700UL)))
#define bM4_PORT_PCRE14_POUTE                     (*((volatile unsigned int*)(0x42A7A704UL)))
#define bM4_PORT_PCRE14_NOD                       (*((volatile unsigned int*)(0x42A7A708UL)))
#define bM4_PORT_PCRE14_DRV0                      (*((volatile unsigned int*)(0x42A7A710UL)))
#define bM4_PORT_PCRE14_DRV1                      (*((volatile unsigned int*)(0x42A7A714UL)))
#define bM4_PORT_PCRE14_PUU                       (*((volatile unsigned int*)(0x42A7A718UL)))
#define bM4_PORT_PCRE14_PIN                       (*((volatile unsigned int*)(0x42A7A720UL)))
#define bM4_PORT_PCRE14_INVE                      (*((volatile unsigned int*)(0x42A7A724UL)))
#define bM4_PORT_PCRE14_INTE                      (*((volatile unsigned int*)(0x42A7A730UL)))
#define bM4_PORT_PCRE14_LTE                       (*((volatile unsigned int*)(0x42A7A738UL)))
#define bM4_PORT_PCRE14_DDIS                      (*((volatile unsigned int*)(0x42A7A73CUL)))
#define bM4_PORT_PFSRE14_FSEL0                    (*((volatile unsigned int*)(0x42A7A740UL)))
#define bM4_PORT_PFSRE14_FSEL1                    (*((volatile unsigned int*)(0x42A7A744UL)))
#define bM4_PORT_PFSRE14_FSEL2                    (*((volatile unsigned int*)(0x42A7A748UL)))
#define bM4_PORT_PFSRE14_FSEL3                    (*((volatile unsigned int*)(0x42A7A74CUL)))
#define bM4_PORT_PFSRE14_FSEL4                    (*((volatile unsigned int*)(0x42A7A750UL)))
#define bM4_PORT_PFSRE14_FSEL5                    (*((volatile unsigned int*)(0x42A7A754UL)))
#define bM4_PORT_PFSRE14_BFE                      (*((volatile unsigned int*)(0x42A7A760UL)))
#define bM4_PORT_PCRE15_POUT                      (*((volatile unsigned int*)(0x42A7A780UL)))
#define bM4_PORT_PCRE15_POUTE                     (*((volatile unsigned int*)(0x42A7A784UL)))
#define bM4_PORT_PCRE15_NOD                       (*((volatile unsigned int*)(0x42A7A788UL)))
#define bM4_PORT_PCRE15_DRV0                      (*((volatile unsigned int*)(0x42A7A790UL)))
#define bM4_PORT_PCRE15_DRV1                      (*((volatile unsigned int*)(0x42A7A794UL)))
#define bM4_PORT_PCRE15_PUU                       (*((volatile unsigned int*)(0x42A7A798UL)))
#define bM4_PORT_PCRE15_PIN                       (*((volatile unsigned int*)(0x42A7A7A0UL)))
#define bM4_PORT_PCRE15_INVE                      (*((volatile unsigned int*)(0x42A7A7A4UL)))
#define bM4_PORT_PCRE15_INTE                      (*((volatile unsigned int*)(0x42A7A7B0UL)))
#define bM4_PORT_PCRE15_LTE                       (*((volatile unsigned int*)(0x42A7A7B8UL)))
#define bM4_PORT_PCRE15_DDIS                      (*((volatile unsigned int*)(0x42A7A7BCUL)))
#define bM4_PORT_PFSRE15_FSEL0                    (*((volatile unsigned int*)(0x42A7A7C0UL)))
#define bM4_PORT_PFSRE15_FSEL1                    (*((volatile unsigned int*)(0x42A7A7C4UL)))
#define bM4_PORT_PFSRE15_FSEL2                    (*((volatile unsigned int*)(0x42A7A7C8UL)))
#define bM4_PORT_PFSRE15_FSEL3                    (*((volatile unsigned int*)(0x42A7A7CCUL)))
#define bM4_PORT_PFSRE15_FSEL4                    (*((volatile unsigned int*)(0x42A7A7D0UL)))
#define bM4_PORT_PFSRE15_FSEL5                    (*((volatile unsigned int*)(0x42A7A7D4UL)))
#define bM4_PORT_PFSRE15_BFE                      (*((volatile unsigned int*)(0x42A7A7E0UL)))
#define bM4_PORT_PCRH0_POUT                       (*((volatile unsigned int*)(0x42A7A800UL)))
#define bM4_PORT_PCRH0_POUTE                      (*((volatile unsigned int*)(0x42A7A804UL)))
#define bM4_PORT_PCRH0_NOD                        (*((volatile unsigned int*)(0x42A7A808UL)))
#define bM4_PORT_PCRH0_DRV0                       (*((volatile unsigned int*)(0x42A7A810UL)))
#define bM4_PORT_PCRH0_DRV1                       (*((volatile unsigned int*)(0x42A7A814UL)))
#define bM4_PORT_PCRH0_PUU                        (*((volatile unsigned int*)(0x42A7A818UL)))
#define bM4_PORT_PCRH0_PIN                        (*((volatile unsigned int*)(0x42A7A820UL)))
#define bM4_PORT_PCRH0_INVE                       (*((volatile unsigned int*)(0x42A7A824UL)))
#define bM4_PORT_PCRH0_INTE                       (*((volatile unsigned int*)(0x42A7A830UL)))
#define bM4_PORT_PCRH0_LTE                        (*((volatile unsigned int*)(0x42A7A838UL)))
#define bM4_PORT_PCRH0_DDIS                       (*((volatile unsigned int*)(0x42A7A83CUL)))
#define bM4_PORT_PFSRH0_FSEL0                     (*((volatile unsigned int*)(0x42A7A840UL)))
#define bM4_PORT_PFSRH0_FSEL1                     (*((volatile unsigned int*)(0x42A7A844UL)))
#define bM4_PORT_PFSRH0_FSEL2                     (*((volatile unsigned int*)(0x42A7A848UL)))
#define bM4_PORT_PFSRH0_FSEL3                     (*((volatile unsigned int*)(0x42A7A84CUL)))
#define bM4_PORT_PFSRH0_FSEL4                     (*((volatile unsigned int*)(0x42A7A850UL)))
#define bM4_PORT_PFSRH0_FSEL5                     (*((volatile unsigned int*)(0x42A7A854UL)))
#define bM4_PORT_PFSRH0_BFE                       (*((volatile unsigned int*)(0x42A7A860UL)))
#define bM4_PORT_PCRH1_POUT                       (*((volatile unsigned int*)(0x42A7A880UL)))
#define bM4_PORT_PCRH1_POUTE                      (*((volatile unsigned int*)(0x42A7A884UL)))
#define bM4_PORT_PCRH1_NOD                        (*((volatile unsigned int*)(0x42A7A888UL)))
#define bM4_PORT_PCRH1_DRV0                       (*((volatile unsigned int*)(0x42A7A890UL)))
#define bM4_PORT_PCRH1_DRV1                       (*((volatile unsigned int*)(0x42A7A894UL)))
#define bM4_PORT_PCRH1_PUU                        (*((volatile unsigned int*)(0x42A7A898UL)))
#define bM4_PORT_PCRH1_PIN                        (*((volatile unsigned int*)(0x42A7A8A0UL)))
#define bM4_PORT_PCRH1_INVE                       (*((volatile unsigned int*)(0x42A7A8A4UL)))
#define bM4_PORT_PCRH1_INTE                       (*((volatile unsigned int*)(0x42A7A8B0UL)))
#define bM4_PORT_PCRH1_LTE                        (*((volatile unsigned int*)(0x42A7A8B8UL)))
#define bM4_PORT_PCRH1_DDIS                       (*((volatile unsigned int*)(0x42A7A8BCUL)))
#define bM4_PORT_PFSRH1_FSEL0                     (*((volatile unsigned int*)(0x42A7A8C0UL)))
#define bM4_PORT_PFSRH1_FSEL1                     (*((volatile unsigned int*)(0x42A7A8C4UL)))
#define bM4_PORT_PFSRH1_FSEL2                     (*((volatile unsigned int*)(0x42A7A8C8UL)))
#define bM4_PORT_PFSRH1_FSEL3                     (*((volatile unsigned int*)(0x42A7A8CCUL)))
#define bM4_PORT_PFSRH1_FSEL4                     (*((volatile unsigned int*)(0x42A7A8D0UL)))
#define bM4_PORT_PFSRH1_FSEL5                     (*((volatile unsigned int*)(0x42A7A8D4UL)))
#define bM4_PORT_PFSRH1_BFE                       (*((volatile unsigned int*)(0x42A7A8E0UL)))
#define bM4_PORT_PCRH2_POUT                       (*((volatile unsigned int*)(0x42A7A900UL)))
#define bM4_PORT_PCRH2_POUTE                      (*((volatile unsigned int*)(0x42A7A904UL)))
#define bM4_PORT_PCRH2_NOD                        (*((volatile unsigned int*)(0x42A7A908UL)))
#define bM4_PORT_PCRH2_DRV0                       (*((volatile unsigned int*)(0x42A7A910UL)))
#define bM4_PORT_PCRH2_DRV1                       (*((volatile unsigned int*)(0x42A7A914UL)))
#define bM4_PORT_PCRH2_PUU                        (*((volatile unsigned int*)(0x42A7A918UL)))
#define bM4_PORT_PCRH2_PIN                        (*((volatile unsigned int*)(0x42A7A920UL)))
#define bM4_PORT_PCRH2_INVE                       (*((volatile unsigned int*)(0x42A7A924UL)))
#define bM4_PORT_PCRH2_INTE                       (*((volatile unsigned int*)(0x42A7A930UL)))
#define bM4_PORT_PCRH2_LTE                        (*((volatile unsigned int*)(0x42A7A938UL)))
#define bM4_PORT_PCRH2_DDIS                       (*((volatile unsigned int*)(0x42A7A93CUL)))
#define bM4_PORT_PFSRH2_FSEL0                     (*((volatile unsigned int*)(0x42A7A940UL)))
#define bM4_PORT_PFSRH2_FSEL1                     (*((volatile unsigned int*)(0x42A7A944UL)))
#define bM4_PORT_PFSRH2_FSEL2                     (*((volatile unsigned int*)(0x42A7A948UL)))
#define bM4_PORT_PFSRH2_FSEL3                     (*((volatile unsigned int*)(0x42A7A94CUL)))
#define bM4_PORT_PFSRH2_FSEL4                     (*((volatile unsigned int*)(0x42A7A950UL)))
#define bM4_PORT_PFSRH2_FSEL5                     (*((volatile unsigned int*)(0x42A7A954UL)))
#define bM4_PORT_PFSRH2_BFE                       (*((volatile unsigned int*)(0x42A7A960UL)))
#define bM4_RTC_CR0_RESET                         (*((volatile unsigned int*)(0x42980000UL)))
#define bM4_RTC_CR1_PRDS0                         (*((volatile unsigned int*)(0x42980080UL)))
#define bM4_RTC_CR1_PRDS1                         (*((volatile unsigned int*)(0x42980084UL)))
#define bM4_RTC_CR1_PRDS2                         (*((volatile unsigned int*)(0x42980088UL)))
#define bM4_RTC_CR1_AMPM                          (*((volatile unsigned int*)(0x4298008CUL)))
#define bM4_RTC_CR1_ALMFCLR                       (*((volatile unsigned int*)(0x42980090UL)))
#define bM4_RTC_CR1_ONEHZOE                       (*((volatile unsigned int*)(0x42980094UL)))
#define bM4_RTC_CR1_ONEHZSEL                      (*((volatile unsigned int*)(0x42980098UL)))
#define bM4_RTC_CR1_START                         (*((volatile unsigned int*)(0x4298009CUL)))
#define bM4_RTC_CR2_RWREQ                         (*((volatile unsigned int*)(0x42980100UL)))
#define bM4_RTC_CR2_RWEN                          (*((volatile unsigned int*)(0x42980104UL)))
#define bM4_RTC_CR2_ALMF                          (*((volatile unsigned int*)(0x4298010CUL)))
#define bM4_RTC_CR2_PRDIE                         (*((volatile unsigned int*)(0x42980114UL)))
#define bM4_RTC_CR2_ALMIE                         (*((volatile unsigned int*)(0x42980118UL)))
#define bM4_RTC_CR2_ALME                          (*((volatile unsigned int*)(0x4298011CUL)))
#define bM4_RTC_CR3_LRCEN                         (*((volatile unsigned int*)(0x42980190UL)))
#define bM4_RTC_CR3_RCKSEL                        (*((volatile unsigned int*)(0x4298019CUL)))
#define bM4_RTC_SEC_SECU0                         (*((volatile unsigned int*)(0x42980200UL)))
#define bM4_RTC_SEC_SECU1                         (*((volatile unsigned int*)(0x42980204UL)))
#define bM4_RTC_SEC_SECU2                         (*((volatile unsigned int*)(0x42980208UL)))
#define bM4_RTC_SEC_SECU3                         (*((volatile unsigned int*)(0x4298020CUL)))
#define bM4_RTC_SEC_SECD0                         (*((volatile unsigned int*)(0x42980210UL)))
#define bM4_RTC_SEC_SECD1                         (*((volatile unsigned int*)(0x42980214UL)))
#define bM4_RTC_SEC_SECD2                         (*((volatile unsigned int*)(0x42980218UL)))
#define bM4_RTC_MIN_MINU0                         (*((volatile unsigned int*)(0x42980280UL)))
#define bM4_RTC_MIN_MINU1                         (*((volatile unsigned int*)(0x42980284UL)))
#define bM4_RTC_MIN_MINU2                         (*((volatile unsigned int*)(0x42980288UL)))
#define bM4_RTC_MIN_MINU3                         (*((volatile unsigned int*)(0x4298028CUL)))
#define bM4_RTC_MIN_MIND0                         (*((volatile unsigned int*)(0x42980290UL)))
#define bM4_RTC_MIN_MIND1                         (*((volatile unsigned int*)(0x42980294UL)))
#define bM4_RTC_MIN_MIND2                         (*((volatile unsigned int*)(0x42980298UL)))
#define bM4_RTC_HOUR_HOURU0                       (*((volatile unsigned int*)(0x42980300UL)))
#define bM4_RTC_HOUR_HOURU1                       (*((volatile unsigned int*)(0x42980304UL)))
#define bM4_RTC_HOUR_HOURU2                       (*((volatile unsigned int*)(0x42980308UL)))
#define bM4_RTC_HOUR_HOURU3                       (*((volatile unsigned int*)(0x4298030CUL)))
#define bM4_RTC_HOUR_HOURD0                       (*((volatile unsigned int*)(0x42980310UL)))
#define bM4_RTC_HOUR_HOURD1                       (*((volatile unsigned int*)(0x42980314UL)))
#define bM4_RTC_WEEK_WEEK0                        (*((volatile unsigned int*)(0x42980380UL)))
#define bM4_RTC_WEEK_WEEK1                        (*((volatile unsigned int*)(0x42980384UL)))
#define bM4_RTC_WEEK_WEEK2                        (*((volatile unsigned int*)(0x42980388UL)))
#define bM4_RTC_DAY_DAYU0                         (*((volatile unsigned int*)(0x42980400UL)))
#define bM4_RTC_DAY_DAYU1                         (*((volatile unsigned int*)(0x42980404UL)))
#define bM4_RTC_DAY_DAYU2                         (*((volatile unsigned int*)(0x42980408UL)))
#define bM4_RTC_DAY_DAYU3                         (*((volatile unsigned int*)(0x4298040CUL)))
#define bM4_RTC_DAY_DAYD0                         (*((volatile unsigned int*)(0x42980410UL)))
#define bM4_RTC_DAY_DAYD1                         (*((volatile unsigned int*)(0x42980414UL)))
#define bM4_RTC_MON_MON0                          (*((volatile unsigned int*)(0x42980480UL)))
#define bM4_RTC_MON_MON1                          (*((volatile unsigned int*)(0x42980484UL)))
#define bM4_RTC_MON_MON2                          (*((volatile unsigned int*)(0x42980488UL)))
#define bM4_RTC_MON_MON3                          (*((volatile unsigned int*)(0x4298048CUL)))
#define bM4_RTC_MON_MON4                          (*((volatile unsigned int*)(0x42980490UL)))
