SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pehb_template/common/hc32f460pehb.h
#define bM4_TMR43_OCMRLVL_EOPPKL1                 (*((volatile unsigned int*)(0x4249865CUL)))
#define bM4_TMR43_OCMRLVL_EOPUCL0                 (*((volatile unsigned int*)(0x42498660UL)))
#define bM4_TMR43_OCMRLVL_EOPUCL1                 (*((volatile unsigned int*)(0x42498664UL)))
#define bM4_TMR43_OCMRLVL_EOPZRL0                 (*((volatile unsigned int*)(0x42498668UL)))
#define bM4_TMR43_OCMRLVL_EOPZRL1                 (*((volatile unsigned int*)(0x4249866CUL)))
#define bM4_TMR43_OCMRLVL_EOPNPKL0                (*((volatile unsigned int*)(0x42498670UL)))
#define bM4_TMR43_OCMRLVL_EOPNPKL1                (*((volatile unsigned int*)(0x42498674UL)))
#define bM4_TMR43_OCMRLVL_EOPNZRL0                (*((volatile unsigned int*)(0x42498678UL)))
#define bM4_TMR43_OCMRLVL_EOPNZRL1                (*((volatile unsigned int*)(0x4249867CUL)))
#define bM4_TMR43_OCMRHWH_OCFDCH                  (*((volatile unsigned int*)(0x42498680UL)))
#define bM4_TMR43_OCMRHWH_OCFPKH                  (*((volatile unsigned int*)(0x42498684UL)))
#define bM4_TMR43_OCMRHWH_OCFUCH                  (*((volatile unsigned int*)(0x42498688UL)))
#define bM4_TMR43_OCMRHWH_OCFZRH                  (*((volatile unsigned int*)(0x4249868CUL)))
#define bM4_TMR43_OCMRHWH_OPDCH0                  (*((volatile unsigned int*)(0x42498690UL)))
#define bM4_TMR43_OCMRHWH_OPDCH1                  (*((volatile unsigned int*)(0x42498694UL)))
#define bM4_TMR43_OCMRHWH_OPPKH0                  (*((volatile unsigned int*)(0x42498698UL)))
#define bM4_TMR43_OCMRHWH_OPPKH1                  (*((volatile unsigned int*)(0x4249869CUL)))
#define bM4_TMR43_OCMRHWH_OPUCH0                  (*((volatile unsigned int*)(0x424986A0UL)))
#define bM4_TMR43_OCMRHWH_OPUCH1                  (*((volatile unsigned int*)(0x424986A4UL)))
#define bM4_TMR43_OCMRHWH_OPZRH0                  (*((volatile unsigned int*)(0x424986A8UL)))
#define bM4_TMR43_OCMRHWH_OPZRH1                  (*((volatile unsigned int*)(0x424986ACUL)))
#define bM4_TMR43_OCMRHWH_OPNPKH0                 (*((volatile unsigned int*)(0x424986B0UL)))
#define bM4_TMR43_OCMRHWH_OPNPKH1                 (*((volatile unsigned int*)(0x424986B4UL)))
#define bM4_TMR43_OCMRHWH_OPNZRH0                 (*((volatile unsigned int*)(0x424986B8UL)))
#define bM4_TMR43_OCMRHWH_OPNZRH1                 (*((volatile unsigned int*)(0x424986BCUL)))
#define bM4_TMR43_OCMRLWL_OCFDCL                  (*((volatile unsigned int*)(0x42498700UL)))
#define bM4_TMR43_OCMRLWL_OCFPKL                  (*((volatile unsigned int*)(0x42498704UL)))
#define bM4_TMR43_OCMRLWL_OCFUCL                  (*((volatile unsigned int*)(0x42498708UL)))
#define bM4_TMR43_OCMRLWL_OCFZRL                  (*((volatile unsigned int*)(0x4249870CUL)))
#define bM4_TMR43_OCMRLWL_OPDCL0                  (*((volatile unsigned int*)(0x42498710UL)))
#define bM4_TMR43_OCMRLWL_OPDCL1                  (*((volatile unsigned int*)(0x42498714UL)))
#define bM4_TMR43_OCMRLWL_OPPKL0                  (*((volatile unsigned int*)(0x42498718UL)))
#define bM4_TMR43_OCMRLWL_OPPKL1                  (*((volatile unsigned int*)(0x4249871CUL)))
#define bM4_TMR43_OCMRLWL_OPUCL0                  (*((volatile unsigned int*)(0x42498720UL)))
#define bM4_TMR43_OCMRLWL_OPUCL1                  (*((volatile unsigned int*)(0x42498724UL)))
#define bM4_TMR43_OCMRLWL_OPZRL0                  (*((volatile unsigned int*)(0x42498728UL)))
#define bM4_TMR43_OCMRLWL_OPZRL1                  (*((volatile unsigned int*)(0x4249872CUL)))
#define bM4_TMR43_OCMRLWL_OPNPKL0                 (*((volatile unsigned int*)(0x42498730UL)))
#define bM4_TMR43_OCMRLWL_OPNPKL1                 (*((volatile unsigned int*)(0x42498734UL)))
#define bM4_TMR43_OCMRLWL_OPNZRL0                 (*((volatile unsigned int*)(0x42498738UL)))
#define bM4_TMR43_OCMRLWL_OPNZRL1                 (*((volatile unsigned int*)(0x4249873CUL)))
#define bM4_TMR43_OCMRLWL_EOPNDCL0                (*((volatile unsigned int*)(0x42498740UL)))
#define bM4_TMR43_OCMRLWL_EOPNDCL1                (*((volatile unsigned int*)(0x42498744UL)))
#define bM4_TMR43_OCMRLWL_EOPNUCL0                (*((volatile unsigned int*)(0x42498748UL)))
#define bM4_TMR43_OCMRLWL_EOPNUCL1                (*((volatile unsigned int*)(0x4249874CUL)))
#define bM4_TMR43_OCMRLWL_EOPDCL0                 (*((volatile unsigned int*)(0x42498750UL)))
#define bM4_TMR43_OCMRLWL_EOPDCL1                 (*((volatile unsigned int*)(0x42498754UL)))
#define bM4_TMR43_OCMRLWL_EOPPKL0                 (*((volatile unsigned int*)(0x42498758UL)))
#define bM4_TMR43_OCMRLWL_EOPPKL1                 (*((volatile unsigned int*)(0x4249875CUL)))
#define bM4_TMR43_OCMRLWL_EOPUCL0                 (*((volatile unsigned int*)(0x42498760UL)))
#define bM4_TMR43_OCMRLWL_EOPUCL1                 (*((volatile unsigned int*)(0x42498764UL)))
#define bM4_TMR43_OCMRLWL_EOPZRL0                 (*((volatile unsigned int*)(0x42498768UL)))
#define bM4_TMR43_OCMRLWL_EOPZRL1                 (*((volatile unsigned int*)(0x4249876CUL)))
#define bM4_TMR43_OCMRLWL_EOPNPKL0                (*((volatile unsigned int*)(0x42498770UL)))
#define bM4_TMR43_OCMRLWL_EOPNPKL1                (*((volatile unsigned int*)(0x42498774UL)))
#define bM4_TMR43_OCMRLWL_EOPNZRL0                (*((volatile unsigned int*)(0x42498778UL)))
#define bM4_TMR43_OCMRLWL_EOPNZRL1                (*((volatile unsigned int*)(0x4249877CUL)))
#define bM4_TMR43_CCSR_CKDIV0                     (*((volatile unsigned int*)(0x42498900UL)))
#define bM4_TMR43_CCSR_CKDIV1                     (*((volatile unsigned int*)(0x42498904UL)))
#define bM4_TMR43_CCSR_CKDIV2                     (*((volatile unsigned int*)(0x42498908UL)))
#define bM4_TMR43_CCSR_CKDIV3                     (*((volatile unsigned int*)(0x4249890CUL)))
#define bM4_TMR43_CCSR_CLEAR                      (*((volatile unsigned int*)(0x42498910UL)))
#define bM4_TMR43_CCSR_MODE                       (*((volatile unsigned int*)(0x42498914UL)))
#define bM4_TMR43_CCSR_STOP                       (*((volatile unsigned int*)(0x42498918UL)))
#define bM4_TMR43_CCSR_BUFEN                      (*((volatile unsigned int*)(0x4249891CUL)))
#define bM4_TMR43_CCSR_IRQPEN                     (*((volatile unsigned int*)(0x42498920UL)))
#define bM4_TMR43_CCSR_IRQPF                      (*((volatile unsigned int*)(0x42498924UL)))
#define bM4_TMR43_CCSR_IRQZEN                     (*((volatile unsigned int*)(0x42498934UL)))
#define bM4_TMR43_CCSR_IRQZF                      (*((volatile unsigned int*)(0x42498938UL)))
#define bM4_TMR43_CCSR_ECKEN                      (*((volatile unsigned int*)(0x4249893CUL)))
#define bM4_TMR43_CVPR_ZIM0                       (*((volatile unsigned int*)(0x42498940UL)))
#define bM4_TMR43_CVPR_ZIM1                       (*((volatile unsigned int*)(0x42498944UL)))
#define bM4_TMR43_CVPR_ZIM2                       (*((volatile unsigned int*)(0x42498948UL)))
#define bM4_TMR43_CVPR_ZIM3                       (*((volatile unsigned int*)(0x4249894CUL)))
#define bM4_TMR43_CVPR_PIM0                       (*((volatile unsigned int*)(0x42498950UL)))
#define bM4_TMR43_CVPR_PIM1                       (*((volatile unsigned int*)(0x42498954UL)))
#define bM4_TMR43_CVPR_PIM2                       (*((volatile unsigned int*)(0x42498958UL)))
#define bM4_TMR43_CVPR_PIM3                       (*((volatile unsigned int*)(0x4249895CUL)))
#define bM4_TMR43_CVPR_ZIC0                       (*((volatile unsigned int*)(0x42498960UL)))
#define bM4_TMR43_CVPR_ZIC1                       (*((volatile unsigned int*)(0x42498964UL)))
#define bM4_TMR43_CVPR_ZIC2                       (*((volatile unsigned int*)(0x42498968UL)))
#define bM4_TMR43_CVPR_ZIC3                       (*((volatile unsigned int*)(0x4249896CUL)))
#define bM4_TMR43_CVPR_PIC0                       (*((volatile unsigned int*)(0x42498970UL)))
#define bM4_TMR43_CVPR_PIC1                       (*((volatile unsigned int*)(0x42498974UL)))
#define bM4_TMR43_CVPR_PIC2                       (*((volatile unsigned int*)(0x42498978UL)))
#define bM4_TMR43_CVPR_PIC3                       (*((volatile unsigned int*)(0x4249897CUL)))
#define bM4_TMR43_POCRU_DIVCK0                    (*((volatile unsigned int*)(0x42499300UL)))
#define bM4_TMR43_POCRU_DIVCK1                    (*((volatile unsigned int*)(0x42499304UL)))
#define bM4_TMR43_POCRU_DIVCK2                    (*((volatile unsigned int*)(0x42499308UL)))
#define bM4_TMR43_POCRU_DIVCK3                    (*((volatile unsigned int*)(0x4249930CUL)))
#define bM4_TMR43_POCRU_PWMMD0                    (*((volatile unsigned int*)(0x42499310UL)))
#define bM4_TMR43_POCRU_PWMMD1                    (*((volatile unsigned int*)(0x42499314UL)))
#define bM4_TMR43_POCRU_LVLS0                     (*((volatile unsigned int*)(0x42499318UL)))
#define bM4_TMR43_POCRU_LVLS1                     (*((volatile unsigned int*)(0x4249931CUL)))
#define bM4_TMR43_POCRV_DIVCK0                    (*((volatile unsigned int*)(0x42499380UL)))
#define bM4_TMR43_POCRV_DIVCK1                    (*((volatile unsigned int*)(0x42499384UL)))
#define bM4_TMR43_POCRV_DIVCK2                    (*((volatile unsigned int*)(0x42499388UL)))
#define bM4_TMR43_POCRV_DIVCK3                    (*((volatile unsigned int*)(0x4249938CUL)))
#define bM4_TMR43_POCRV_PWMMD0                    (*((volatile unsigned int*)(0x42499390UL)))
#define bM4_TMR43_POCRV_PWMMD1                    (*((volatile unsigned int*)(0x42499394UL)))
#define bM4_TMR43_POCRV_LVLS0                     (*((volatile unsigned int*)(0x42499398UL)))
#define bM4_TMR43_POCRV_LVLS1                     (*((volatile unsigned int*)(0x4249939CUL)))
#define bM4_TMR43_POCRW_DIVCK0                    (*((volatile unsigned int*)(0x42499400UL)))
#define bM4_TMR43_POCRW_DIVCK1                    (*((volatile unsigned int*)(0x42499404UL)))
#define bM4_TMR43_POCRW_DIVCK2                    (*((volatile unsigned int*)(0x42499408UL)))
#define bM4_TMR43_POCRW_DIVCK3                    (*((volatile unsigned int*)(0x4249940CUL)))
#define bM4_TMR43_POCRW_PWMMD0                    (*((volatile unsigned int*)(0x42499410UL)))
#define bM4_TMR43_POCRW_PWMMD1                    (*((volatile unsigned int*)(0x42499414UL)))
#define bM4_TMR43_POCRW_LVLS0                     (*((volatile unsigned int*)(0x42499418UL)))
#define bM4_TMR43_POCRW_LVLS1                     (*((volatile unsigned int*)(0x4249941CUL)))
#define bM4_TMR43_RCSR_RTIDU                      (*((volatile unsigned int*)(0x42499480UL)))
#define bM4_TMR43_RCSR_RTIDV                      (*((volatile unsigned int*)(0x42499484UL)))
#define bM4_TMR43_RCSR_RTIDW                      (*((volatile unsigned int*)(0x42499488UL)))
#define bM4_TMR43_RCSR_RTIFU                      (*((volatile unsigned int*)(0x42499490UL)))
#define bM4_TMR43_RCSR_RTICU                      (*((volatile unsigned int*)(0x42499494UL)))
#define bM4_TMR43_RCSR_RTEU                       (*((volatile unsigned int*)(0x42499498UL)))
#define bM4_TMR43_RCSR_RTSU                       (*((volatile unsigned int*)(0x4249949CUL)))
#define bM4_TMR43_RCSR_RTIFV                      (*((volatile unsigned int*)(0x424994A0UL)))
#define bM4_TMR43_RCSR_RTICV                      (*((volatile unsigned int*)(0x424994A4UL)))
#define bM4_TMR43_RCSR_RTEV                       (*((volatile unsigned int*)(0x424994A8UL)))
#define bM4_TMR43_RCSR_RTSV                       (*((volatile unsigned int*)(0x424994ACUL)))
#define bM4_TMR43_RCSR_RTIFW                      (*((volatile unsigned int*)(0x424994B0UL)))
#define bM4_TMR43_RCSR_RTICW                      (*((volatile unsigned int*)(0x424994B4UL)))
#define bM4_TMR43_RCSR_RTEW                       (*((volatile unsigned int*)(0x424994B8UL)))
#define bM4_TMR43_RCSR_RTSW                       (*((volatile unsigned int*)(0x424994BCUL)))
#define bM4_TMR43_SCSRUH_BUFEN0                   (*((volatile unsigned int*)(0x42499900UL)))
#define bM4_TMR43_SCSRUH_BUFEN1                   (*((volatile unsigned int*)(0x42499904UL)))
#define bM4_TMR43_SCSRUH_EVTOS0                   (*((volatile unsigned int*)(0x42499908UL)))
#define bM4_TMR43_SCSRUH_EVTOS1                   (*((volatile unsigned int*)(0x4249990CUL)))
#define bM4_TMR43_SCSRUH_EVTOS2                   (*((volatile unsigned int*)(0x42499910UL)))
#define bM4_TMR43_SCSRUH_LMC                      (*((volatile unsigned int*)(0x42499914UL)))
#define bM4_TMR43_SCSRUH_EVTMS                    (*((volatile unsigned int*)(0x42499920UL)))
#define bM4_TMR43_SCSRUH_EVTDS                    (*((volatile unsigned int*)(0x42499924UL)))
#define bM4_TMR43_SCSRUH_DEN                      (*((volatile unsigned int*)(0x42499930UL)))
#define bM4_TMR43_SCSRUH_PEN                      (*((volatile unsigned int*)(0x42499934UL)))
#define bM4_TMR43_SCSRUH_UEN                      (*((volatile unsigned int*)(0x42499938UL)))
#define bM4_TMR43_SCSRUH_ZEN                      (*((volatile unsigned int*)(0x4249993CUL)))
#define bM4_TMR43_SCMRUH_AMC0                     (*((volatile unsigned int*)(0x42499940UL)))
#define bM4_TMR43_SCMRUH_AMC1                     (*((volatile unsigned int*)(0x42499944UL)))
#define bM4_TMR43_SCMRUH_AMC2                     (*((volatile unsigned int*)(0x42499948UL)))
#define bM4_TMR43_SCMRUH_AMC3                     (*((volatile unsigned int*)(0x4249994CUL)))
#define bM4_TMR43_SCMRUH_MZCE                     (*((volatile unsigned int*)(0x42499958UL)))
#define bM4_TMR43_SCMRUH_MPCE                     (*((volatile unsigned int*)(0x4249995CUL)))
#define bM4_TMR43_SCSRUL_BUFEN0                   (*((volatile unsigned int*)(0x42499980UL)))
#define bM4_TMR43_SCSRUL_BUFEN1                   (*((volatile unsigned int*)(0x42499984UL)))
#define bM4_TMR43_SCSRUL_EVTOS0                   (*((volatile unsigned int*)(0x42499988UL)))
#define bM4_TMR43_SCSRUL_EVTOS1                   (*((volatile unsigned int*)(0x4249998CUL)))
#define bM4_TMR43_SCSRUL_EVTOS2                   (*((volatile unsigned int*)(0x42499990UL)))
#define bM4_TMR43_SCSRUL_LMC                      (*((volatile unsigned int*)(0x42499994UL)))
#define bM4_TMR43_SCSRUL_EVTMS                    (*((volatile unsigned int*)(0x424999A0UL)))
#define bM4_TMR43_SCSRUL_EVTDS                    (*((volatile unsigned int*)(0x424999A4UL)))
#define bM4_TMR43_SCSRUL_DEN                      (*((volatile unsigned int*)(0x424999B0UL)))
#define bM4_TMR43_SCSRUL_PEN                      (*((volatile unsigned int*)(0x424999B4UL)))
#define bM4_TMR43_SCSRUL_UEN                      (*((volatile unsigned int*)(0x424999B8UL)))
#define bM4_TMR43_SCSRUL_ZEN                      (*((volatile unsigned int*)(0x424999BCUL)))
#define bM4_TMR43_SCMRUL_AMC0                     (*((volatile unsigned int*)(0x424999C0UL)))
#define bM4_TMR43_SCMRUL_AMC1                     (*((volatile unsigned int*)(0x424999C4UL)))
#define bM4_TMR43_SCMRUL_AMC2                     (*((volatile unsigned int*)(0x424999C8UL)))
#define bM4_TMR43_SCMRUL_AMC3                     (*((volatile unsigned int*)(0x424999CCUL)))
#define bM4_TMR43_SCMRUL_MZCE                     (*((volatile unsigned int*)(0x424999D8UL)))
#define bM4_TMR43_SCMRUL_MPCE                     (*((volatile unsigned int*)(0x424999DCUL)))
#define bM4_TMR43_SCSRVH_BUFEN0                   (*((volatile unsigned int*)(0x42499A00UL)))
#define bM4_TMR43_SCSRVH_BUFEN1                   (*((volatile unsigned int*)(0x42499A04UL)))
#define bM4_TMR43_SCSRVH_EVTOS0                   (*((volatile unsigned int*)(0x42499A08UL)))
#define bM4_TMR43_SCSRVH_EVTOS1                   (*((volatile unsigned int*)(0x42499A0CUL)))
#define bM4_TMR43_SCSRVH_EVTOS2                   (*((volatile unsigned int*)(0x42499A10UL)))
#define bM4_TMR43_SCSRVH_LMC                      (*((volatile unsigned int*)(0x42499A14UL)))
#define bM4_TMR43_SCSRVH_EVTMS                    (*((volatile unsigned int*)(0x42499A20UL)))
#define bM4_TMR43_SCSRVH_EVTDS                    (*((volatile unsigned int*)(0x42499A24UL)))
#define bM4_TMR43_SCSRVH_DEN                      (*((volatile unsigned int*)(0x42499A30UL)))
#define bM4_TMR43_SCSRVH_PEN                      (*((volatile unsigned int*)(0x42499A34UL)))
#define bM4_TMR43_SCSRVH_UEN                      (*((volatile unsigned int*)(0x42499A38UL)))
#define bM4_TMR43_SCSRVH_ZEN                      (*((volatile unsigned int*)(0x42499A3CUL)))
#define bM4_TMR43_SCMRVH_AMC0                     (*((volatile unsigned int*)(0x42499A40UL)))
#define bM4_TMR43_SCMRVH_AMC1                     (*((volatile unsigned int*)(0x42499A44UL)))
#define bM4_TMR43_SCMRVH_AMC2                     (*((volatile unsigned int*)(0x42499A48UL)))
#define bM4_TMR43_SCMRVH_AMC3                     (*((volatile unsigned int*)(0x42499A4CUL)))
#define bM4_TMR43_SCMRVH_MZCE                     (*((volatile unsigned int*)(0x42499A58UL)))
#define bM4_TMR43_SCMRVH_MPCE                     (*((volatile unsigned int*)(0x42499A5CUL)))
#define bM4_TMR43_SCSRVL_BUFEN0                   (*((volatile unsigned int*)(0x42499A80UL)))
#define bM4_TMR43_SCSRVL_BUFEN1                   (*((volatile unsigned int*)(0x42499A84UL)))
#define bM4_TMR43_SCSRVL_EVTOS0                   (*((volatile unsigned int*)(0x42499A88UL)))
#define bM4_TMR43_SCSRVL_EVTOS1                   (*((volatile unsigned int*)(0x42499A8CUL)))
#define bM4_TMR43_SCSRVL_EVTOS2                   (*((volatile unsigned int*)(0x42499A90UL)))
#define bM4_TMR43_SCSRVL_LMC                      (*((volatile unsigned int*)(0x42499A94UL)))
#define bM4_TMR43_SCSRVL_EVTMS                    (*((volatile unsigned int*)(0x42499AA0UL)))
#define bM4_TMR43_SCSRVL_EVTDS                    (*((volatile unsigned int*)(0x42499AA4UL)))
#define bM4_TMR43_SCSRVL_DEN                      (*((volatile unsigned int*)(0x42499AB0UL)))
#define bM4_TMR43_SCSRVL_PEN                      (*((volatile unsigned int*)(0x42499AB4UL)))
#define bM4_TMR43_SCSRVL_UEN                      (*((volatile unsigned int*)(0x42499AB8UL)))
#define bM4_TMR43_SCSRVL_ZEN                      (*((volatile unsigned int*)(0x42499ABCUL)))
#define bM4_TMR43_SCMRVL_AMC0                     (*((volatile unsigned int*)(0x42499AC0UL)))
#define bM4_TMR43_SCMRVL_AMC1                     (*((volatile unsigned int*)(0x42499AC4UL)))
#define bM4_TMR43_SCMRVL_AMC2                     (*((volatile unsigned int*)(0x42499AC8UL)))
#define bM4_TMR43_SCMRVL_AMC3                     (*((volatile unsigned int*)(0x42499ACCUL)))
#define bM4_TMR43_SCMRVL_MZCE                     (*((volatile unsigned int*)(0x42499AD8UL)))
#define bM4_TMR43_SCMRVL_MPCE                     (*((volatile unsigned int*)(0x42499ADCUL)))
#define bM4_TMR43_SCSRWH_BUFEN0                   (*((volatile unsigned int*)(0x42499B00UL)))
#define bM4_TMR43_SCSRWH_BUFEN1                   (*((volatile unsigned int*)(0x42499B04UL)))
#define bM4_TMR43_SCSRWH_EVTOS0                   (*((volatile unsigned int*)(0x42499B08UL)))
#define bM4_TMR43_SCSRWH_EVTOS1                   (*((volatile unsigned int*)(0x42499B0CUL)))
#define bM4_TMR43_SCSRWH_EVTOS2                   (*((volatile unsigned int*)(0x42499B10UL)))
#define bM4_TMR43_SCSRWH_LMC                      (*((volatile unsigned int*)(0x42499B14UL)))
#define bM4_TMR43_SCSRWH_EVTMS                    (*((volatile unsigned int*)(0x42499B20UL)))
#define bM4_TMR43_SCSRWH_EVTDS                    (*((volatile unsigned int*)(0x42499B24UL)))
#define bM4_TMR43_SCSRWH_DEN                      (*((volatile unsigned int*)(0x42499B30UL)))
#define bM4_TMR43_SCSRWH_PEN                      (*((volatile unsigned int*)(0x42499B34UL)))
#define bM4_TMR43_SCSRWH_UEN                      (*((volatile unsigned int*)(0x42499B38UL)))
#define bM4_TMR43_SCSRWH_ZEN                      (*((volatile unsigned int*)(0x42499B3CUL)))
#define bM4_TMR43_SCMRWH_AMC0                     (*((volatile unsigned int*)(0x42499B40UL)))
#define bM4_TMR43_SCMRWH_AMC1                     (*((volatile unsigned int*)(0x42499B44UL)))
#define bM4_TMR43_SCMRWH_AMC2                     (*((volatile unsigned int*)(0x42499B48UL)))
#define bM4_TMR43_SCMRWH_AMC3                     (*((volatile unsigned int*)(0x42499B4CUL)))
#define bM4_TMR43_SCMRWH_MZCE                     (*((volatile unsigned int*)(0x42499B58UL)))
#define bM4_TMR43_SCMRWH_MPCE                     (*((volatile unsigned int*)(0x42499B5CUL)))
#define bM4_TMR43_SCSRWL_BUFEN0                   (*((volatile unsigned int*)(0x42499B80UL)))
#define bM4_TMR43_SCSRWL_BUFEN1                   (*((volatile unsigned int*)(0x42499B84UL)))
#define bM4_TMR43_SCSRWL_EVTOS0                   (*((volatile unsigned int*)(0x42499B88UL)))
#define bM4_TMR43_SCSRWL_EVTOS1                   (*((volatile unsigned int*)(0x42499B8CUL)))
#define bM4_TMR43_SCSRWL_EVTOS2                   (*((volatile unsigned int*)(0x42499B90UL)))
#define bM4_TMR43_SCSRWL_LMC                      (*((volatile unsigned int*)(0x42499B94UL)))
#define bM4_TMR43_SCSRWL_EVTMS                    (*((volatile unsigned int*)(0x42499BA0UL)))
#define bM4_TMR43_SCSRWL_EVTDS                    (*((volatile unsigned int*)(0x42499BA4UL)))
#define bM4_TMR43_SCSRWL_DEN                      (*((volatile unsigned int*)(0x42499BB0UL)))
#define bM4_TMR43_SCSRWL_PEN                      (*((volatile unsigned int*)(0x42499BB4UL)))
#define bM4_TMR43_SCSRWL_UEN                      (*((volatile unsigned int*)(0x42499BB8UL)))
#define bM4_TMR43_SCSRWL_ZEN                      (*((volatile unsigned int*)(0x42499BBCUL)))
#define bM4_TMR43_SCMRWL_AMC0                     (*((volatile unsigned int*)(0x42499BC0UL)))
#define bM4_TMR43_SCMRWL_AMC1                     (*((volatile unsigned int*)(0x42499BC4UL)))
#define bM4_TMR43_SCMRWL_AMC2                     (*((volatile unsigned int*)(0x42499BC8UL)))
#define bM4_TMR43_SCMRWL_AMC3                     (*((volatile unsigned int*)(0x42499BCCUL)))
#define bM4_TMR43_SCMRWL_MZCE                     (*((volatile unsigned int*)(0x42499BD8UL)))
#define bM4_TMR43_SCMRWL_MPCE                     (*((volatile unsigned int*)(0x42499BDCUL)))
#define bM4_TMR43_ECSR_HOLD                       (*((volatile unsigned int*)(0x42499E1CUL)))
#define bM4_TMR4_CR_ECER1_EMBVAL0                 (*((volatile unsigned int*)(0x42AA8100UL)))
#define bM4_TMR4_CR_ECER1_EMBVAL1                 (*((volatile unsigned int*)(0x42AA8104UL)))
#define bM4_TMR4_CR_ECER2_EMBVAL0                 (*((volatile unsigned int*)(0x42AA8180UL)))
#define bM4_TMR4_CR_ECER2_EMBVAL1                 (*((volatile unsigned int*)(0x42AA8184UL)))
#define bM4_TMR4_CR_ECER3_EMBVAL0                 (*((volatile unsigned int*)(0x42AA8200UL)))
#define bM4_TMR4_CR_ECER3_EMBVAL1                 (*((volatile unsigned int*)(0x42AA8204UL)))
#define bM4_TMR61_CNTER_CNT0                      (*((volatile unsigned int*)(0x42300000UL)))
#define bM4_TMR61_CNTER_CNT1                      (*((volatile unsigned int*)(0x42300004UL)))
#define bM4_TMR61_CNTER_CNT2                      (*((volatile unsigned int*)(0x42300008UL)))
#define bM4_TMR61_CNTER_CNT3                      (*((volatile unsigned int*)(0x4230000CUL)))
#define bM4_TMR61_CNTER_CNT4                      (*((volatile unsigned int*)(0x42300010UL)))
#define bM4_TMR61_CNTER_CNT5                      (*((volatile unsigned int*)(0x42300014UL)))
#define bM4_TMR61_CNTER_CNT6                      (*((volatile unsigned int*)(0x42300018UL)))
#define bM4_TMR61_CNTER_CNT7                      (*((volatile unsigned int*)(0x4230001CUL)))
#define bM4_TMR61_CNTER_CNT8                      (*((volatile unsigned int*)(0x42300020UL)))
#define bM4_TMR61_CNTER_CNT9                      (*((volatile unsigned int*)(0x42300024UL)))
#define bM4_TMR61_CNTER_CNT10                     (*((volatile unsigned int*)(0x42300028UL)))
#define bM4_TMR61_CNTER_CNT11                     (*((volatile unsigned int*)(0x4230002CUL)))
#define bM4_TMR61_CNTER_CNT12                     (*((volatile unsigned int*)(0x42300030UL)))
#define bM4_TMR61_CNTER_CNT13                     (*((volatile unsigned int*)(0x42300034UL)))
#define bM4_TMR61_CNTER_CNT14                     (*((volatile unsigned int*)(0x42300038UL)))
